{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": 1,
		"3_18sw1reMFB1fpxc4vjfjoCrLaFs8UbMeQH": 1,
		"1_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": [
			{
				"comment_id": 1,
				"body": "> [bukaking](#comment_14_17n5jg4bBEoWodXDf8L4Y2u88ShagS272Y): They will likely flood ZeroNet with antisemitism and racism and then on CNN/FoxNews say how ZeroNet is den for hate speech and that ZeroNet must be banned/regulated.\n\nexactly what the jew Ed Miliband of UK wanted to railroad thru when he was PM of UK.\n\nLuckily our Klansmen stopped this dirty jew from grabbing power in UK.",
				"added": 1458541466
			},
			{
				"comment_id": 2,
				"body": "> [zerobunker](#comment_108_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar): please make you own version of zerotalk for politic and conspiracy theory, this forum is for dev and learn how to use zeronet feature.\n> i think you are smarter than the jews to make your own version zerotalk right...??\n\nstfu, you dirty jew",
				"added": 1458541510
			}
		],
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 3,
				"body": "> [musickiller](#comment_93_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): And I thought we were building a cenzure-free network. Guess I was wrong.\n\nYou were indeed... This is a network for Holohoax believers.",
				"added": 1458541579
			},
			{
				"comment_id": 4,
				"body": "> [antifa](#comment_3_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h): Trump supporters, nazis, libertarians/ancaps, and other scum are trying to infect every online community. There's been a huge neo-fascist revival on the internet in the last couple years.\n\nbullshit. people are just sick and tired of forking out trillions of € $$ € to filthy dirty jews for their fake Holohoaxes.",
				"added": 1458541675
			},
			{
				"comment_id": 6,
				"body": "> [antifa](#comment_5_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h): a holohoax, like a hologram of bigfoot or a ufo or something? what do you mean?\n\nIt has been shown that no proof of a gas chamber exists. Even the Auschwitz curator Piper, PhD., conducted a secret chemical analysis and found nothing. No Prussian Blue at all.\n\nThe gas chamber never existed.",
				"added": 1458541946
			}
		],
		"1_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2": [
			{
				"comment_id": 5,
				"body": "you were actually a jew Holohoax victim if the Allieds bombed a jew to death.\n\nsee, not everything the Allieds did was wrong.",
				"added": 1458541822
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 7,
				"body": "the jews are asking for 6 more billions of U$D or €uro because they found 10 more dead jews.",
				"added": 1458542050
			}
		]
	},
	"comment_vote": {
		"14_17n5jg4bBEoWodXDf8L4Y2u88ShagS272Y": 1,
		"93_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1
	}
}