{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_12SuCFUNDaMYRHG9DsWCyCN1NgHGjddwSJ": [
			{
				"comment_id": 1,
				"body": "إعلان استقلال للفضاء السبراني\n\nيا حكومات العالم الصناعي، يا عمالقةً بالينَ من لحم و فولاذ، آتي إليكم من الفضاء السِبرانيّ، الموطن الجديد للعقل. باسم المستقبل، أسألكم يا من تنتمون للماضي أن تدعونا لشأننا؛ لستم أهلاً و لا تحلِّون سهلاً؛ و لا سلطان لكم حيث نجتمع.\n\nليست لنا حكومة منتخبة و لن تكون لنا على الأرجح حكومة؛ لذا فإني أخاطبكم بسلطة لا تزيد عن تلك التي طالما تحدثت بها الحرية نفسها لأعلن أن الفضاء الاجتماعي العالمي الذي ننشئه مستقل بطبيعته عن الطاغوت الذي تسعون لفرضه علينا؛ ليست لكم شرعية لتحكمونا و لا بيدكم وسيلة لقهرنا تستحق أن نخشاها.\n\nتستمد الحكومات قوتها المُسْتَحَقَّةَ من رضوخ المحكومين، و أنتم لم تطلبوا خضوعنا ولا نحن أعلنّاه لكم. نحن لم ندْعُكُم. أنتم لا تعرفوننا و لا تعرفون عالمنا. الفضاء السبراني لا يقع داخل حدودكم، فلا تظنوا أنكم يمكنكم إنشاؤه كما لو كان مشروع مرفق عمومي، فأنتم لا تستطيعون ذلك. إنه من فعل الطبيعة و هو يُنمي ذاته من خلال عملنا الجمعي.\n\nأنتم لم تنخرطوا في محاوراتنا الجامعة العظيمة، كما أنكم لم تخلقوا الثروة التي في أسواقنا. أنتم لا تعرفون ثقافتنا، و لا أخلاقنا، و لا قوانينا غير المكتوبة التي تنظم مجتمعنا بأكثر مما يمكن لكم أن تفرضوه.\n\nتزعمون أن ثمة مشاكل بيننا عليكم أن تحلوها و تستغلون هذا كذريعة للتدخل في ربوعنا. كثير من هذه المشاكل غير موجود؛ و حيثما وجدت صراعات و حيثما تكمن أخطاء، فسوف نراها و نعالجها بطُرُقنا. نحن نعمل على تشكيل عَقْدنا الاجتماعي الخاص. و حاكميتنا سوف تنشأ طبقا لظروف عالمنا، لا عالمكم؛ فعالمنا يختلف عن عالمكم.\n\nيتكون الفضاء السِّبراني من تبادلات و علاقات، و من الفكر ذاته؛ كلها مصفوفة كموجة ناتئة في شبكة اتصالاتنا. عالمنا موجود في كل مكان و في اللامكان في الآن ذاته، لكنه ليس حيث تعيش الأجساد.\n\nنحن نخلق عالما يمكن للجميع أن يدخلوه بلا ميزة و بلا حكم مسبق على عرقهم أو على قدرتهم الاقتصادية أو العسكرية أو على محل ميلادهم.\n\nنحن نخلق عالما يمكن فيه لأيٍّ كان في أي مكان التعبير عن رأيه أو رأيها، بغض النظر عن قدر تَفَرُّدِ هذا الرأي، بلا خوف من أن يُكره على الصمت أو على التوافق.\n\nمفاهيمكم عن الملكية و التعبير و الهوية، و الحراك و السياق لا تنطبق علينا، فكلها مبينة على المادة، و لا مادة هنا.\n\nهوياتنا لا أجساد لها، لذا فعلى غير حالكم، لا يمكننا إرساء النظام عن طريق الإكراه الجسدي. نحن نؤمن أنه عن طريق الأخلاق و المصلحة الخاصة المستنيرة و الصالح العام، ستنشأ حاكميتنا. هوياتنا قد تكون موزعة على عديد من قضاءاتكم، إلا أن القانون الأوحد الذي تعترف به ثقافاتنا المكوِّنة هو القاعدة الذهبية. نأمل أن نستطيع أن نقيم حلولنا الموائمة على هذا الأساس، إلا أننا لا نقبل الحلول التي تحاولون فرضها علينا.\n\nفي الولايات المتحدة الأمريكية وضعتم قانون إصلاح الاتصالات، و هو يناقض دستوركم أنتم أنفسكم و يبدد أحلام [توماس] جيفرسون و [جورج] واشنطن و [جون ستوارت] مِل و [جيمس] مادِسون و [ألكسس] دي⁬تُكڤل و [لويس دِمبتس] برانديس. هذه الأحلام يجب أن تولد من جديد فينا.\n\nأنتم تخشون أبنائكم، لأنهم أُصلاء في عالم ستظلون أنتم دائما مهاجرين إليه. و لأنكم تخشونهم فأنتم توكلون إلى بيروقراطياتِكم مسؤولياتَكم الأبوية التي تخشون أن تواجهون أنفسكم بها. في عالمنا كل الأهواء و التجليات البشرية، من أدناها إلى أسماها، جزءٌ من كلٍ غير متمايز هو حوار البتَّات العالمي. نحن لا يمكننا أن نميز ما بين الهواء الذي يَخنُق و الهواء الذي تُحلِّق عليه الأجنحة.\n\nفي الصين و ألمانيا و فرنسا و روسيا و سنغافورة و إيطاليا و الولايات المتحدة الأمريكية تحاولون درء ڤيروس الحرية بإقامة نقاط حراسة على طول جبهة الفضاء السِّبراني. قد يصد هذا العدوى لوقت قصير لكنه لن يفلح في العالم الذي سوف يلتحف قريبا بميديا حاملةٍ البتات.\n\nإن صناعاتكم المعلوماتية الباطلة تحاول إرجاء أجلها عن طريق اقتراح تشريعات، في أمريكا و في غيرها، تَدَّعي ملكية الكلام ذاته في أنحاء العالم. هذه القوانين ستعامِل الأفكار كمنتج صناعي، لا يسمو على الحديد الزَّرد. في عالمنا، كل ما يمكن للعقل البشري أن يخلقه يمكن أن يُنسخ و يوزع بلا حدود و بلا كلفة. لم يعد انتقال الأفكار يحتاج مصانعكم ليتحقق.\n\nإن الممارسات الاستعمارية و العدائية التي تزداد وطأتها باستمرار تضعنا موضع من سبقونا من عشاق الحرية و تقرير مصير أنفسهم، الذين اضطروا لأن يرفضوا سلطة غاشمة من منأى. علينا أن نعلن حصانة ذواتنا الافتراضية على سلطانكم، حتى و نحن لا نزال خاضعين لسطوتكم على أجسادنا. سوف ننشر أنفسنا على الكوكب حتى لا يتسنى لأحد أن يعتقل أفكارنا.\n\nسوف نخلق حضارة للعقل في الفضاء السبراني. عسى أن تكون أكثر إنسانية و عدلا من العالم الذي صنعته حكوماتكم من قبل.\n\nداڤوس، سويسرا\n08\\02\\1996",
				"added": 1457114148
			}
		]
	},
	"comment_vote": {}
}