{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Just the casual test :-o",
				"added": 1475622431
			},
			{
				"comment_id": 9,
				"body": "> [beard](#comment_1_1L6kM35jc1KwpPi8LpEsCJmgXw2RM3UW1W): isnt this fun?\n\nIt is indeed. Can you answer please i still didn't test.",
				"added": 1475680083
			}
		],
		"1_1HRrLnTaJwRCA24L45Sr3cYJ3nDmJmPabf": [
			{
				"comment_id": 2,
				"body": "Earth realm? Whatever it is...",
				"added": 1475622572
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 3,
				"body": "> [mrwhite](#comment_1_1NnciDBNk2s2o8ASCmXkhfvqR1qws6QNuq): Who do you mean by we?\n> Christians that aren't brainwashed with meh universal equality or judeo primacy bullshit are mostly fine. Moslems and Jews are not because they want to kill or enslave us all any way they can.\n> Who do you think the capitalist leaders are?\n> The same people own or control all the important business, institutions, media, and politicians, as well as all the money.\n> What better system are you referring to?\n> Capitalism is just the tails side of the shekel and communism is heads. Exchanging one for the other won't get us anywhere.\n> Is there a third alternative to communism and captialism?\n> Maybe you're under the illusion that THE PEOPLE know what's best for themselves?  Unfortunately they absolutely do not. Never have. I wish it wasn't true but it is. Accordingly the weak cannot be permitted to influence state policy directly because they will be exploited and manipulated at every turn by those seeking to gain power for their own ends at the expense of the common good. Only a strong leader with a vested interest in the welfare of his people can make the right decision when faced with a decision that requires a strong character to make.\n\nJust for you to know, there wasn't any real communism in the modern history, except the last existing primitive tribes. What you refer as communism, which i guess is URSS, Cuba and North Korea, isn't communism, but state capitalism. They have money as a mean of exchange. They have political economy. Thus what is commonly refered as communist is, in fact, state capitalism. \n\nOnce this is understood, people will open they mind to a new mode of production.",
				"added": 1475623051
			},
			{
				"comment_id": 4,
				"body": "> [jewish](#comment_2_1K92Q9FtzTWLQC6x5wUQBanNniZTb45wEH): Jewish know how to make money and how to use others.\n\nThat's the point. In a system without money, jews would be just like the others. The jews don't make the capitalistic mode of production, they are just the capital elite. Should all the jews disappear, there would be an other elite to take their place.",
				"added": 1475623817
			},
			{
				"comment_id": 7,
				"body": "> [becoming](#comment_8_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Communism, if it is ever to arise, won't arise out of a positive ambition for it. It will arise out of the refusal to accept that there is either: private property or currency.\n\n\nThe german tribes who fought the romans were communists (real ones not bolsheviks aka state capitalists). \n\nThey shares the land, the animals, the food, the tools. It's only around the 5-6 century that they began to use currency and private property. \n\nAlso during the middle age, which is presented by the mainstream system as dark age, many things were shared, like lands, tools etc...\n\nPrivate property doesn't exist in homo sapiens natural state. \n\nHomo sapiens lived from 160000 BC to 12000 BC without private property. \n\nI do no say that you shall not own your own computer or your own toothbrush, but the means of production (factories, lands, power stations), should be shared in a non monetary system.",
				"added": 1475664161
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 5,
				"body": "> [teszt](#comment_53_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): \n> Hillary Clinton: “ ... if I'm the president, we will attack Iran \"https://www.youtube.com/watch?v=rTt-xhF02GgDo you really want that ?\n\nClinton is crazy and dangerous for sure.\n\nHowever, do we have such low ambitions they we contempt ourselves with this representative democracy scam? \n\nTrump is not Jesus. I re-watched the Devils advocate a few weeks ago and Donald Trump is refereed to in the movie (in the Gala scene).\n\nThen, like a flash in my mind, and even if before i was seduced by Trump personnality, i understood : they are the same.  \n\nRepresentative democracy is a scam. The infamous  Colonel House explained it in his book Philip Dru: administrator.  In a representative democracy, about half the population will want to vote for one candidate, and about half for the other. In the middle lies the indecisive. All the mass medias have to do is to push on the scale in one direction or the other to convince the weakest and stupidest people there is: the indecisive. Too stupid and weak to even have an objective opinion about a candidate. With this crowd psychology related mechanism, mass-medias control the election. \n\nThat why representative democracy is a scam in all context but in this one in particular. \n\nAbout one half for Clinton, one half for Trump, like always, and then in the middle, regarding the 5% of indecisives, the mass medias own by the elite and the spin doctors do their bidding. Regarding this 5%, the movement is almost what was wanted by the elite. In rare occasion, there are surprises, but anyway, Trump clearly represent the system in all it's aspects. Certainly he has some charism and a flavor which might appeal for many, but he'll only perpetrate the system. \nLike Robert Greene wrote in the 48 laws, in a political election, often the choice is between Charybdis and Scylla. \n\nIt's done like that since the beginning of the 20th century.",
				"added": 1475625285
			},
			{
				"comment_id": 6,
				"body": "> [jewish](#comment_3_1K92Q9FtzTWLQC6x5wUQBanNniZTb45wEH): Don't fool yourself. Both candidates have been approved by Israel.\n\nIf you want power as people, never delegate it. \n\nWhatever candidate run for presidential election, he will be approved by Israel and the financial system. \n\nDelegating power is the best way to no exercising it.",
				"added": 1475663541
			},
			{
				"comment_id": 8,
				"body": "> [teszt](#comment_54_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): The genetics have made huge discoveries during the last decades.There is no white race. All existing humans are a single race in biological taxonomic sense as they can have common children and have the same number of chromosomes.Homo sapiens and Homo neanderthal could be considered human sub-races. They are genetic evidences that an interbreeding between them occurred in the Middle-East 50 000 years ago.\n> \n> 100% Africans are 100% Homo sapiens with 0% Homo neanderthal blood.\n> non-Africans - Europeans, Asians, black people from India and black people from Papua are 1-4% Homo neanderthal and 96-99% Homo sapiens interbred.So genetically only this two human sub-races exists - with or without Neanderthal blood. All others are just sub-sub-races.\n\nWhat you say is true, and interesting.\n\nHowever, you know that regarding african americans, they are around 20% to 50% white. So when does a black people stop to be of african descent? When does he \"become\" white? Is the DNA related to abstract reasoning dominant or recessive characteristic? \n\nEven if we were to all mix ourselves in one race (i'm not  an advocate of this). Would we be stupidest than now? Or is the intelligence genes dominant, so it won't really matter in the end? By the way, mixing people don't make the gene disappear, even if it's recessive. E.G, if a blue eye (blue-blue alleles) have children with a brown eye (brown-brown alleles), the children will be brown eye, but the child, even can have blue eye children if he have children with a blue eye person or a brown blue allele person (1/4 chances).  However, if the gene become negligible in proportion, it could somehow disappear, but then the sexual selection intervene. Successful, thus most intelligent men (most of the time), will have more children, or at least enough children, so there genes will still be passed down future generations. \nSo no, in theory, there is no risk that the human intelligence disappear. Asian will probably be the most dominant ethnic group in a century anyway.",
				"added": 1475670477
			}
		],
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 10,
				"body": "It's used to geo engineering, among other aims. Strontium, baryum, aluminium.... Healthy heavy metals.",
				"added": 1475704085
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 11,
				"body": "Have to say something important, mostly for north american people. No offense, it's some remnant from the  Maccarthysme era so it's perfectly understandable: \n\nWhat you refer, still today, as communism, isn't in fact communism, but state capitalism. \n\nWhat was going on in URSS (bolcheviks), Cuba, China (Mao Zedung) and still today in North Korea, isn't communism.\n\nIt's planned economy; political economy; state capitalism.\n\nThey have/had a state, and they use currency. So it never was communism.\n\nIf you want to understand real communism, take an interest in the last primitive tribes around the world. Or easiest way, see the beginning of the movie Apocalypto (Mel Gibson).",
				"added": 1475778738
			},
			{
				"comment_id": 12,
				"body": "> [kosherx](#comment_5_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): A rat with his fancy computer - therefore PRIVATE PROPERTY - calling me a rat. Oh, the irony.\n\nA computer isn't a mean (most of the time anyway) of production. Private property of the means of production alienate humans (factories, power stations, lands etc...).",
				"added": 1475840171
			}
		]
	},
	"comment_vote": {
		"17_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1
	}
}