{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"5_1C6qdRAX8iYqSB7TfUxk91yW8Y2SBKNgfA": [
			{
				"comment_id": 1,
				"body": "To me it seems that the 2016 verson of ZeroNet is a collection of very nice work at the usability side. It really excels at that. However, even the current case demonstrates that the security that people tend to expect from ZeroNet, SUCKS BIG TIME. I also like to add that it's not really only ZeroNet that has the pattern, where enthusiastic, user centric, developers grab some off-the-shelf components and write a glamorious, usability oriented, application, leaving the security and even software architecture related deep-techical, under-the-hood, things \"for later date\", causing the project eventually to fail. The Freenet is an example of such a project, where the architecture side is a mess, the Freenet implementation essentially consists of impossible-to-verify binary blobs, because the open source components chosen for the implementation is a mess. Yet another example of a usability-first-development-architecture-second project is the Meteor JavaScript framework  \n\nhttps://www.meteor.com/\n\nIt all looks nice and shiny on the surface, open source and everything, but actually the project is such a mess that at least a few years ago, when I studied it, the Meteor was usable only on x86 hardware, non Raspberry Pi, because the \"open source\" was not able to compile some of its components and the build script contained a workaround that just downloaded x86 binary blobs. That was not some sort of a \"quick build\", but the bootstrapping type of build. \n\nI guess that it has more to do with developer mindset than anything else. Interestingly the usability-first-technical-details-second style of approach is actually even being challenged at GUI development. The Lazarus and Free Pascal community seem to have some really nice, systematic, approach to all-things-GUI. They do not seem to be in the rush of releasing quckly-and-shiny. They just develop something and release it, when it's done, with full knowledge that they will never be able to compete with the World-Wide-Party that takes place at the Web side. So they focus on technical quality.",
				"added": 1473119608
			}
		],
		"1_1Eb3jLeJMFfN5z7oUhNbiLqYn24fTofzEJ": [
			{
				"comment_id": 2,
				"body": "Could You please elaborate on the DNS shutdown? \n\nThe Electronic Frontiers Foundation web site \nhttps://www.eff.org/press\ndoes not even mention the issue, neither does \nhttps://theintercept.com/\nand neither do the\nhttp://www.lauraflanders.com/\nand \nhttp://www.democracynow.org/",
				"added": 1473141921
			},
			{
				"comment_id": 3,
				"body": "Secondly, the way I understand, the ZeroNet actually reveals user identities even, if tunneled through Tor, because if a page has an image from the open-web, then the image is downloaded directly. The recommendation to poke holes to routers to allow connections to be initiated from WAN to LAN does not seem encouraging either. To me it seems that the ZeroNet is a glorious open-web application that will be shut down the moment internet connections get shut down, unlike \nhttp://www.silktorrent.ch\nwhich is still a work in progress, not ready for prime time, but has at least counter-measures designed in from the very start.",
				"added": 1473142188
			},
			{
				"comment_id": 4,
				"body": "A test case for ZeroNet:\nhttps://motherboard.vice.com/read/two-months-of-internet-blackouts-have-taken-a-toll-on-kashmir",
				"added": 1473142289
			},
			{
				"comment_id": 5,
				"body": "> [zanzibarland](#comment_2_1PUA3WTqEzUWkEsX7DbCeoY229Y5iN9aMc): what about places where the internet is stable and safe?\n\nThank U 4 Your answer. If by \"safe internet\" You mean something like \"safe road to travel\", assuming that \"the internet\" is just a global tool for transferring data from one computer to another, then the analogy might be that if You are a bear or a tiger, then You might try to imagine, how many \"safe roads\" do You have, where You can walk without being shot by police/hunters/community-guards/anybody-with-a-gun? You might argue that there are some rural roads that get crossed all the time by wild life, but I guess that the \"travel plans\" of the wild life, specially predators, is much more constrained than the \"blacks\" had during the height of the segregation period. \n\nTechnically speaking, anything that uses TCP/IP tends to use some public infrastructure and all public infrastructure is de facto owned by the party that has the greatest capability and will to inflict violence. That's the reason, why internet service providers (ISP-s) allow FBI/KGB/STASI/whatever-have-you-at-your-home-region wiretap, spy on their clients. If they did not act as a restaurant that poisons its own clients on the request of the mafia, in this case, the State, would shut them down. A historic example from the USA:\n\nhttps://lavabit.com/\nhttps://www.theguardian.com/technology/2013/aug/08/lavabit-email-shut-down-edward-snowden\n\nAnother examples are the North-Korea and Cuba. Of course, the list is incomplete. I suggest that You look at the video that is referenced from:\n\nhttps://theintercept.com/a-conversation-about-privacy/\n\nThe only good news is that it is possible to transfer data through censored channels by using steganography. The idea is that meaning depends on the context and if the censoring party does not have the context, they do not understand that the color sequence of cloths hanging outside to dry might be a huge sign in plain sight of everybody. That's what even the Edward Snowden used for communicating with his girlfriend:\n\nhttps://jezebel.com/edward-snowdens-girlfriend-posts-two-mysterious-new-blo-1691034461\n\nI suggest that You use TorBrowser to look at the awesome stories that the former Cold War spies tell at\n\nhttps://www.youtube.com/user/IntlSpyMuseum",
				"added": 1473262618
			},
			{
				"comment_id": 6,
				"body": "> [zanzibarland](#comment_3_1PUA3WTqEzUWkEsX7DbCeoY229Y5iN9aMc): I guess what I mean is, what about places like the US and Canada where public internet - google, news sites, youtube, twitch, netflix, online gaming, etc - is so ingrained in most people's day-to-day that a total shutdown of TCP/IP would result in (or be due to) riots in the streets and the collapse of civilized society.\n> So as long as we have TCP/IP doesn't that mean we can run Zeronet overtop of it? And paired with VPN and Tor, would that not cloak users from all but the most dedicated 3-letter agency investigations?\n\nThank U 4 Your answer. \nWell, think of it this way: back in the Cold War era paper letters were intrinsic part of the bureaucracy of every Goverment. They were not capable of operating without it, yet that did not stop them from applying censorship. TCP/IP is based on data-packets, which are like little, tiny, letters, which flow and carry small pieces of the transferable data, like ants carry grains. It is possible to argue that if the same piece of data is sent by multiple routs, then even if one route gets blocked, the data packets at the other route come through. That's the idea of duplicated internet connections at data centers, but the difference between a meteor/tsunami/earthquake/wildfire/flood and a targeted attack is that the non-man-made-disasters, with the exception of the meteor that made the dinosaurs extinct, is that they are relatively local. If there's a forest fire or a tsunami at one part of the world, where people die, people at the other parts of the world watch the event from some news channel and eat popcorn or zip coffee. In the case of man-made-disasters, for example, cyber-attacks, wars, the destruction of information channels is systematic and possibly global. \n\nDuring the Soviet Union all paper-letters from Estonia to outside world were first sent to Moscow, so that the KGB can apply censorship and find the possible dissidents. During the first stages of the Iraq war special missiles were fired to take out all communications equipment with EMP.\n\nhttp://www.ausairpower.net/dew-ebomb.html\n\nWhich is kind of funny, because if the mad people, who want to bomb Israel with their missiles, just wrapped the warhead of their rockets with a lot of wire, practically an electrical magnet, that has a lot of current in it right at the moment of explosion(by timing the emptying of a capacitor), then the EMP would fry a lot of the consumer electronics (cellphones, computers, home appliances, washing machines, car electronics, etc.) and create far more economic damage than the few deaths and few broken houses do, specially at an economy that depends on internet sales, e-mail, phone-calls. As You can see from \n\nhttps://www.youtube.com/watch?v=UUPKQi4Nbc0\n\nthe Soviet nuclear missiles had similar countermeasures present already during the Cold War. Governments can also use their personal, military based, communication channels that are separate from the commercial internet. \n\nOne explanation, how Governments can keep on using TCP/IP while switching it all off for all the rest is by destroying all the packets that are have their origin or destination anywhere else than a special government end-point. That is to sya, if the data packet originates from Your home, it is possible to block it without blocking government communication. The the source and destination of the data packet are sufficient information to implement that kind of censorship, without even bothering analyzing anything else. The same with data packets that cellphones use for voice transmission.\n\nMy suggestion is that in stead of asking others for any specific answer, You should ask the following question from YOURSELF: if You were a censor, how would You do Your job?  As You will probably notice, there are multiple solutions that all have some level of success.",
				"added": 1473283780
			},
			{
				"comment_id": 7,
				"body": "What regards to the \"riots\": people do not riot even for far more serious issues than the loss of communication channels. Even in the United States. There is absolutely nothing that stops government from just rounding up all the rioters, just like they did with American Japanese during 2. World War. The Nazis went even further: they just killed the ones, who were rounded up.",
				"added": 1473284335
			},
			{
				"comment_id": 8,
				"body": "One more comment about \"riots\": I guess that the pigs at slaughter-hoses also make some noise during the electricution. \n\nhttps://www.youtube.com/watch?v=rF43weoN8is\n\nAnother option is to take down the leaders of the movement, one by one. I as an European kind of wonder, how the Americans can be so stupid that they believe that some sort of \"popularity\" or \"popular movement\" or \"public noise\" will help them win their opponents. It's a bit like the crazy Roman Emperor, who thought that he is so powerful that he just sings to the invading army and beats the army like that. Europeans are a bit more realistic about those matters and understand that if U R a minority, a hunter with a fine gun, then YOU WIN AND THE MAJORITY, THE PACK OF ANIMALS THAT YOU CAME TO HUNT FOR, WILL DIE. The animals may protest and \"riot\" as much as they want.",
				"added": 1473284730
			},
			{
				"comment_id": 9,
				"body": "A dark joke on the failed United States political system, where the only 2 presidential candidates are both pretty problematic, to say the least, is that if an EMP-bomb is exploded near the buildings, where the Wall Street servers are, and it is done so that ABSOLUTELY NOBODY GETS HURT and absolutely NO DAMAGE TO REAL ESTATE, no broken windows or anything that the media and TV-channels can get any dramatic images from, then that will really rock the United States economy and politics. The twin towers was truly stupid, because it killed and injured a lot of people, but an EMP-attack on Wall Street without any physical injuries to people would be something that an average american would really welcome, because the Wall Street has not been very considerate towards the majority of hard-working Americans. No bodies, no broken windows for TV-channels to report on, PERFECT. :-D",
				"added": 1473292326
			},
			{
				"comment_id": 10,
				"body": "By continuing as a devils advocate here, I guess that the EMP-bomb might be exploded in a van that has plastic walls (for the electromagnetic wave to get out of the van) and the walls are polstered with kevlar, to make sure that the explosion in the van is contained to the van, no projectiles exit the van. If the engine of the van does not contain any electronic parts, the van might even be used multiple times. The driver might be shielded from the EMP by a sheet of metal and then the driver just casually drives around and switches the EMP-s to blow at the back of the van. Of course, the driver cabin must also be mechanically shielded from the projectiles of the EMP-bomb. A perfect hacktivist, \"Ocupy Wall street\" style of project. No human injuries, no real estate damage, just a nasty act towards the Wall Street.",
				"added": 1473292745
			}
		]
	},
	"comment_vote": {}
}