{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet on VPN",
			"body": "Tried it in 2 different ones and was glad to see it works perfectly without issues.  If anyone had issues, comment on which one you had issues. Since there should not be.",
			"added": 1441537559
		}
	],
	"topic_vote": {
		"1_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1BGaNcH1UBqAdatPbT3YssmPRVdhepMNPW": 1,
		"2_1ArMJqDaBJqeJ4MX3VqSnkfwkHe23PtLrW": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "ZeroNet is progressing really well. Very glad to see its progress every month.",
				"added": 1441522650
			}
		],
		"1_14kv9X4pVxpv7Mt2YaESY4Jd7t71BaHxRq": [
			{
				"comment_id": 2,
				"body": "They have a presentation on it: https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000&slide=id.g9a1cce9ee_0_4 ",
				"added": 1441523438
			}
		],
		"1_1GWzYMVUuvpdEKB3Lv9k4yw41nQT5BorpB": [
			{
				"comment_id": 3,
				"body": "Yes, it works.",
				"added": 1441535596
			}
		],
		"1_1FHS5V4FmPFyJQspXVNB3gDVPd3JyjHCv7": [
			{
				"comment_id": 4,
				"body": "> [zerobuba](#comment_3_1FHS5V4FmPFyJQspXVNB3gDVPd3JyjHCv7): Acabo de ver algunos vídeos en el reproductor HTML5, se me ocurrió la idea de crear una pagina donde se puedan compilar películas de terror en dicho reproductor, ¿alguien tiene alguna idea de donde debería empezar? \n\nCual video ahorita es mejor que sea .mp4 para que firefox, edge, safari y IE no tengan problemas.  \n\n",
				"added": 1441584463
			},
			{
				"comment_id": 7,
				"body": "> [cudam](#comment_1_1MBZrgSwMQMRnMFjQkw2JpwdWRaKo7Eb55): Quiza hable de más, todavía no se bien cómo funciona esto... Pero subir videos a una página la va hacer pesar mucho ¿no? Sería mejor subirla en torrent e incrustarla en un reproductor si se pudiera. ¿Me explico?\n\nSi, se a que refieres. Lo que digo es que cuando cargue el reproductor local cualquiera que sea el método en que se este distribuyendo el video. El formato de video mas compatible y versátil sigue siendo .mp4. \n\nAhora, con lo de que la pagina se volvería muy pesada. Pues afortunadamente nofish ya esta probando lo de archivos opcionales. Que permitirían el que los archivos embebidos en una pagina de ZeroNet solo se descarguen bajo demanda.  También es posible crear una pagina que funcione con torrents pero que se reproduzcan en una pagina de zeronet, por lo que he estado viendo.",
				"added": 1450390604
			}
		],
		"1_1FQzw6BBWb8DqSgT3uMsMpcWu3uz48bEDX": [
			{
				"comment_id": 5,
				"body": "Trolling has arrived to ZeroNet.",
				"added": 1441683553
			}
		],
		"2_1ArMJqDaBJqeJ4MX3VqSnkfwkHe23PtLrW": [
			{
				"comment_id": 6,
				"body": "Cool.",
				"added": 1441683859
			}
		]
	},
	"comment_vote": {}
}