{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1MA9FAQkvuKGyyr29ecGJ3FtMjPKBtJhpU": 1,
		"2_1674XymFPbmAXh78xEpt3Pehtko6i2kvtA": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 1,
				"body": "'Gunman Omar Mateen was a closet homosexual':\nhttp://www.telegraph.co.uk/news/2016/06/14/orlando-gunman-was-a-regular-at-lgbt-nightclub-pulse-before-atta/ \nMost homosexuals are killed by homosexuals.\n'The proportion of serial killers who are known to have had homosexual experience is high (over 43%)':\nhttp://www.adherents.com/misc/hsk.html \nIf you kill each other at least be honest and don't blame other people and don't kill normal people.",
				"added": 1465995850
			},
			{
				"comment_id": 2,
				"body": "Homosexuality is very destructive. \n'Hitler was gay - and killed to hide it.'\n\"The respected German historian Lothar Machtan even claims in his book that Hitler ordered the deaths of several high-ranking Nazis to prevent the secret of his homosexuality from surfacing.\"\n\"According to a Munich police protocol from the early part of the 20th century, a 22-Many of the guards and administrators responsible for concentration camp horrors were themselves homosexuals and pedophiles. Famous Nazi hunter Elie Weisel was sent to Auschwitz, where he discovered that the head of his part of the camp \"loved children,\" and observed that \"there was a considerable traffic in young children among homosexuals there.\"year-old man called Joseph told the police: 'I spent the whole night with him.' Another, Michael, who was 18, told them: 'I had been unemployed for months, and my mother and my brother were always hungry, so, at his request, I accompanied the man to his home.' Another, a boy called Franz, said: 'He asked me if I'd like to stay with him and he told me his name was Adolf Hitler.\"\nhttps://www.theguardian.com/world/2001/oct/07/books.booksnews \n\n\"Many of the guards and administrators responsible for concentration camp horrors were themselves homosexuals and pedophiles. Famous Nazi hunter Elie Weisel was sent to Auschwitz, where he discovered that the head of his part of the camp \"loved children,\" and observed that \"there was a considerable traffic in young children among homosexuals there.\"\n\"The \"Butch\" homosexual guards and capos were capable of unrestrained cruelty, sadism and savagery. A guard at Auschwitz, for instance, strangled, crushed and gnawed to death as many as 100 boys and young men a day while raping them at his leisure.\"\n\"Even today in America, it is chic in some homosexual circles for individuals to wear replicas of Nazi Germany uniforms, complete with iron crosses, storm trooper outfits, military boots and even swastikas.\"\n\"Some parts of the American Nazi movement are explicitly homosexual. The National Socialist League, in fact, at last word restricts its membership to homosexual Nazis.\"\nhttp://www.renewamerica.com/columns/fischer/100528",
				"added": 1466085005
			},
			{
				"comment_id": 3,
				"body": "> [assman](#comment_18_18AAv2MxpUxLjG6U64nucoBg833eTaR83u): \n> Russian government is despicable, but it is only one country. \n\nOf course it is. \nGays cannot pervert any more cheap Russian boys. Are your personal rights restricted with this law ?\nhttp://www.yalelawjournal.org/comment/homosexual-propaganda-bans-in-human-rights-law \n'On June 29, 2013, Russian President Vladimir Putin signed into law a bill prohibiting “propaganda of non-traditional sexual relations among minors,” including supportive statements about gay, lesbian, bisexual, and transgender persons.'",
				"added": 1466165738
			},
			{
				"comment_id": 4,
				"body": "> [scrub](#comment_113_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R): \n> Anti-gay comments are disgusting. Yes, I support everyone having the right to express what's on their mind, but why the hate on homosexuals? \n\nThe only hate what I see here is the hate of the homosexuals against all. Against Muslims, against Christians, against Jews, against Russians and against all who don't want homosexuality.\nYou would even wage war against Russia just to get their kids for American homosexuals if they wouldn't have nuclear weapons.",
				"added": 1466256782
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 5,
				"body": "https://s32.postimg.org/umcb3xoqt/image.jpg",
				"added": 1466520295
			}
		],
		"1_1Ao2nMbB9yJPeCbGwKxzJsdDTmtP6N6bWZ": [
			{
				"comment_id": 6,
				"body": "3132",
				"added": 1467207640
			}
		]
	},
	"comment_vote": {
		"1_1N1WCav1oetiu7QpKNXmsfxpeGrEtZ3gCe": 1
	}
}