{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 2,
			"title": "List of various uploaders",
			"body": "General Purpose Sites:\n\n1337x (Popular and many of the users mentioned upload there.)\nExtratorrent (Probably the most popular and populated of all currently. I can confirm that it requires a free registration to sort by date, seeders, etc. When registering, it appears to only be available for donation/VIP accounts, but it's not. Free registration is fine.)\nRARBG (While it's popular for all media, porn is basically on the front page 24/7. I'll link directly to their category pages below to make things simpler as it also doesn't have any kind of user profile system.)\nDemonoid (After it went down a while ago, it's struggled to really keep up and get back to where it was. If Nemesis is uploading there, then it might be beginning to get better, I don't know. You don't need an account, but like Extratorrent, you lose a few features if you don't register. I'd maybe suggest registering just in case it goes private again.)\nZooqle (Really well designed site, in my opinion. Every show has its own page, with each episode listed by number and season like in KAT. There appear to be some issues with VPN users, however. I'd suggest browsing disconnected from VPN and downloading the actual torrents in your client while connected to VPN if this is an issue for you. The site is secured by HTTPS, so browsing while disconnected, you are offered some form of encryption.)\nTorrentz (Probably the most widely used indexing site/directory for torrents.)\nTorrent Project (Another indexing site that scrapes various main torrent sites.)\nIf you're feeling nostalgic, The Pirate Bay is still around. Not worth it, in my opinion, unless that's the only place some of your favorite users are uploading. The UI sucks and it's generally unreliable. But it's there if you want it.\nAhaShare (Another general purpose site.)\nTelevision/Film User Profiles:\n\n_ General Releases (SD/HD/x264) _\nETTV - ET profile, 1337x profile, Pirate Bay profile\nETRG - ET profile, 1337x profile, Pirate Bay profile\nEtHD - ET profile, 1337x profile, Pirate Bay Profile\nJuggs - ET profile, 1337x profile\nSilmarillion - ET profile, 1337x profile\nOzlem - ET profile, Pirate Bay profile\nShAaNiG - ET profile, Pirate Bay profile (Also posts x265, but is still primarily x264.)\nMKVCage - ET profile, 1337x profile\nEscabar779 - ET profile\nSaM - ET profile, 1337x profile, Pirate Bay profile\nCondors - ET profile, Pirate Bay profile\nSnowhiter (-SNO) - Pirate Bay profile\nRedBarron58 - Pirate Bay profile\nEhhhh - ET profile, 1337x profile\nDeeJayAhmed - Pirate Bay profile, Official Aite\nSolarwinds - ET profile (Family/Hallmark movies)\nloadstone - Pirate Bay profile\nZ0n321 - All of z0n321's uploads were sourced directly from RARBG. Unfortunately, RARBG doesn't have user profiles. However I know he always posted rartv releases which can be found on RARBG here. What I've also done is created links directly to the RARBG TV section and the RARBG movies section, so hopefully that covers most of his uploads.\n_ HD/UHD/HEVC/x265 _\nIMPORTANT INFORMATION REGARDING UNITEAM (UTR): https://katcr.co/community/index.php?topic=558.0\nJoyBell - Pirate Bay profile\nNayhtut - Pirate Bay profile\nSharpySword - ET profile\nToxicJames - Official Site\nLordVako - ET profile (Inactive)\nMzabi - 1337x profile (Inactive)\nByteShare - Pirate Bay profile (Inactive)\nFor the above uploaders that are listed as inactive, let me know if you see them posting again or find links where they are active. I'm keeping the links up here for users who still want access to the stuff they did upload until KAT went down.\n_ Sports/WWE/UFC _\nBUTTSKIS/CenaCme - Pirate Bay profile\nTEZ - ET profile\nSCSA420 - Pirate Bay profile\n_ Documentaries/Reality/Gameshows/Latenight _\n2Maverick - Pirate Bay profile\nMVGroup - Pirate Bay profile\nSRIGGA - ET profile\nAnime Releases:\n\nNyaa (Possibly the best and most widely used site for anime.)\nAnimeRG (Widely popular anime release group, this is their primary site. KaMi, pseudo, JRR releases originate here.)\nHorribleSubs (All their torrents are posted on Nyaa, but this is a link to the group's official releases.)\nTokyotosho (Another general anime site.)\nComics/Books/Magazines:\n\nNemesis is uploading to Demonoid, Extratorrent, and The Pirate Bay. For now, it appears he's uploading exclusively to Demonoid.\nShipjolly is uploading to The Pirate Bay.\nI'm still struggling to find good e-book and magazine sources, but here's what I've got so far.\nAhaShareTeam got their books/magazines from AhaShare. I don't know which profile specifically uploaded their releases, so I've linked directly to their books section. Any input would be greatly appreciated.\nGATOQSECOMIO (Spanish-translated e-book author compilations) - 1337x profile, Pirate Bay profile\nAlso, manga can be found on both Nyaa and Tokyotosho listed above.\nGames and Software:\n\nMercs215 - Pirate Bay Profile\nIGGGames - ET profile, Pirate Bay profile\nFitGirl - Official Site, ET profile (Updated to include new site.)\nOjusko - Pirate Bay profile\nJimbus80 - Pirate Bay profile\nZohaib - ET profile\nSadeemPC - ET profile, Pirate Bay profile\nKaranPC - AhaShare profile\nRARBG games section (Most z0n321 game releases were sourced directly from here.)",
			"added": 1470324533
		}
	],
	"topic_vote": {
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	},
	"next_comment_id": 2,
	"comment": {
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 1,
				"body": "I love you, and will always love you till KAT do us part!!!! I pray to lord honey booboo that you manage to recreate the KAT site and all its features and that you are able to bring the uploaders from original KAT to it!",
				"added": 1470778285
			}
		]
	},
	"comment_vote": {}
}