{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_17dEBAxTcyJg38KfNtCvYWp7fddLKHv4rc": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/?RedditNsfwGifs",
				"added": 1456959118
			}
		],
		"1_1HRgRrQ2AwD7qBQkDYrGr7w7Z15o52yiVJ": [
			{
				"comment_id": 2,
				"body": "2180's?)",
				"added": 1456959298
			}
		],
		"1_1EUyJtat7mbu5wMcR6nrJTPBBRons1mtMA": [
			{
				"comment_id": 3,
				"body": "http://www.opennet.ru/opennews/art.shtml?num=43975",
				"added": 1456959425
			}
		],
		"2_1NyFX6DUcyMs3S76Vz8X7ssDLC4uCCA1YM": [
			{
				"comment_id": 4,
				"body": "> [kostanew](#comment_7_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Мой провайдер подменяет https сертефикат для кучи сайтов, например для wordpress.com. Меня это не особо волнует, потому что я не делаю ничего противозаконного, но все равно не приятно. Я уже привык подтвержать прием сертефиката, не смотря на него. Будет очень плохо, если я оплачу покупку, а потом окажется что я сидел под сертефикатом провайдера...\n\nПо-моему этим Казахстан баловался, ну а чё делать, диктатуры боятся любой критики, даже законы соответствующие продавливают, благодаря чему становится легально делать всякие такие какахи против своего же народа.",
				"added": 1457967663
			},
			{
				"comment_id": 5,
				"body": "> [sthetz](#comment_15_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Хз, везде сижу с личного нидерландского прокси, вращал роскомнадзор на хую.\n\nОдин гик ничего не значит, ибо по сути своей меры такие массовые и их влияние направлено именно на массы, твоё же \"вращал роскомнадзор на хую\" в этом контексте выглядит как \"моя хата с краю\", то что 99% твоих соотечественников держат за тупой скот тебя и не волнует никак. Для торжества тупизма достаточно бездействия талантливых людей. К сожалению.",
				"added": 1457967889
			}
		],
		"1_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 6,
				"body": "> [nippletwister](#comment_82_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Пиарить зеронет можно (удачнее всего) на фоне блокировки RuTracker, я недавно сделал пост на Пикабу, так он очень быстро стал набирать очки (дошел до 80, плюс 200 человек утащило его себе в закладки), пока его модераторы не прикрыли под тупым предлогом.\n\n>>пока его модераторы не прикрыли под тупым предлогом\nвот потому то и нужны такие штуки как ZeroNet",
				"added": 1457968368
			}
		]
	},
	"comment_vote": {}
}