{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet needs to tackle FUD today – or the need to build a BS-detector",
			"body": "ZeroNet still seems pretty much in its infancy. However, I bet that law enforcement is already watching – you can’t expect advertising on clearnet sites such as TorrenFreak or Reddit to go unnoticed. If you’re not already familiar with the article, have a look at https://theintercept.com/2014/02/24/jtrig-manipulation/. An extract for those who don’t feel like going through the entire article (and a starting point for this post):\n\n“Among the core self-identified purposes of JTRIG are two tactics: (1) to inject all sorts of false material onto the internet in order to destroy the reputation of its targets; and (2) to use social sciences and other techniques to manipulate online discourse and activism to generate outcomes it considers desirable.“\n\nNow, fields such as political discourse analysis, implicit social cognition, psycho- and sociolinguistics and many more can provide you with some interesting material and tools to fight against this sort of manipulation...\n\n...which leads to the point of this post. First and foremost it is to raise awareness. Second, we need to give people who are trained in social sciences or interested to learn about these fields a platform so their voices can be heard. And, of course, this platform has to be visible to the new and uninitiated because it should act as the firewall to the bullshit Government and other entities (who are opposed to the development of something like ZeroNet) will try to damage the cause. Visibility is certainly the key – people have to have easy access to those linguistic tools, otherwise this endeavor will be futile. Think anti-marketing a.k.a education.\n\nZeroNet isn’t mainstream – by far, but it has potential and that alone will bring law enforcement on its radar. However, as long as you possess the linguistic tools to see through their bullshit, that’s fine. Government, whether corrupt or not, is part of the game, like child porn and terrorism – and sometimes it is equally bad (there you go, a quick example to illustrate an agenda: using a simile to associate Government with the “evils” of society; chances are that next time when you read about something negative related to Gov like police brutality, this comparison will probably pop back in your mind). And please don’t waste your words focusing on this example...of course it is shocking/ridiculous to make such a comparison...(more on that below).\n\nOne thing that you can always count on is people using language without actually knowing what it exactly means. “No censorship”, “Freedom”, “Privacy” etc aren’t just romantic concepts, but they mostly represent extreme views because they cover what we fundamentally are: human. Being human includes everything on the spectrum between the predictable binary thinking society trains us in: good and bad. But those are relative concepts and need to be questioned constantly!\n\nTake the following distinctions:\n\nPathos: “representing an appeal to the emotions of the audience, and elicits feelings that already reside in them”. This is the complete thought behind what we call FUD: fear, uncertainty, and doubt are all feelings considered to be negative. And sure, Governments and other parties against what ZeroNet stands for will try – and succeed to the extent that it’ll slow down the adoption rate of ZeroNet and other, similar alternatives. But you can also misdirect people by creating (false) hopes and other, more positive emotions. So while the title of the discussion is FUD, the topic is emotional manipulation. \n\nLogos: in the sense of Aristotle referring to “reasoned discourse”. Basically, you need to be aware of logical fallacies and they are not always easy to spot. The reason is because unlike my approach to discuss pathos/logos separately, they will work in conjunction. Rhetoric tools such as a “red herring” or a “straw man” will be employed to manipulate you. You’ll find them as part of rhetorical strategies or modes of persuasion.\n\nEthos: Remember the article I’ve linked above? But it’s by Glenn Greenwald...this guy can’t be trusted...he’s in cahoots with Snowden? Isn’t he the traitor who has endangered the lives of all this innocent agents working for the forces of...good ;-) Attacking the author is obviously another strategy that is used to discredit the actual content.\n\nSo how to go about building a bullshit-detector? One thing to keep in mind is to keep language as simple as possible – which doesn’t mean that we need to dumb it down, but to give tangible examples to illustrate the concepts. Say, for instance, we want to give people access to modes of persuasion, we illustrate it with an example such as mentioned earlier: a straw man. Sometimes, you’ll find pretty good explanation on the internet, such as this one: “giving the impression of refuting an opponent's argument, while actually refuting an argument that was not advanced by that opponent.” Sometimes you might even be better able to explain it in your own words.\n\nBut what’s important is the discussion! Something that is expressed in natural language is a bit like a computer program: there will be bugs and other improvements. Take this very text for instance: I’m sure that it is far from perfect and will need some improvements – and everybody reading it can make adjustments, either by introducing new features or bug fixes. Just keep in mind, however, that it is also easily possible to inject malicious “code”. However, since it is open source, you can audit it and remove the crap yourself. Moreover, the good thing with natural language is that you don’t need to be a programmer to do all that.\n\nWhere to take it from here? Well, a starting point could be to create a list of rhetorical strategies or modes of persuasion and to illustrate them. Second, keep up with research. Like computer science, social sciences constantly experiment with new things. Where to find all that? http://sci-hub.cc/ is certainly a start, but this will probably be another site that needs to be protected against censorship. Third, maybe you conduct your own experiments and share them? A starting point is http://neuro.debian.net/. Of course, if you know people who are linguistically capable, just get them involved into ZeroNet and other projects like it. You might be the tech person, but the project as a whole is interdisciplinary.\n\nFinally, what should the platform or zite be called? ZeroAwareness, of course ;-)\n\nP.S.: Don’t forget about the narrative: clearly, this text portrays Government as the enemy. But since it is made up of people, binary thinking may not apply! An abstract entity such as Government doesn’t do shit – the term is just a linguistic VPN/proxy to hide the politicians human IP address ;-)",
			"added": 1471280848
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}