{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 1,
				"body": "> [shellbound](#comment_17_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9):  Same inequality existed during the industrial capitalism he lived under as with the financial capitalism which we lives in. The big destruction of capital of the world wars hid a 30 year anomaly that made it look like Marx was wrong.. but it has corrected itself today..\n\nGold comment.\n\nThe 2 World Wars were reboots. The rate of profit were falling before 1914 and before 1939. Guess what the WW consequence were regarding the rate of profit? There was a huge increase. http://isj.org.uk/wp-content/old-site-images/147/147roberts11.jpg\n\nWho want to really live in such a system?",
				"added": 1475939092
			},
			{
				"comment_id": 2,
				"body": "> [kosherx](#comment_9_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): http://imgur.com/C0JD03K\n\nSlaves were means of production. What's more they were privately owned. A finished PS4 isn't a mean of production. \n\nBy the way capitalism abolished slavery when it's wasn't profitable anymore. In a time, the end of the 19th century, when it was more profitable to employ a worker and dump him when he wasn't useful anymore. \n\nSlaves have to be nurtured, raised, needed a roof,  and kept in line with a group of paid free men. \n\nWorkers are more flexible, and more profitable in the end.",
				"added": 1475940534
			},
			{
				"comment_id": 14,
				"body": "> [tempcom](#comment_1_1KY97qn2wAVxSVTJ3fg8HvxwcJ7rwrPmt4): I think you have fallen prey to thinking of socialism as state ownership or intervention.Socialism is the democratic control over the means of production.Socialism and Capitalism cannot coexist.\n\nIt depend of what you call socialism. \n\nI don't have in mind one single example of socialism in modern era. Most of the time, a political party call himself socialist but it isn't. See what happened in western Europe since the 80s. Never have been more socialist parties but the proletarians (salaried employees) have never been exploited. To be exploited don't mean you have a master who literrally whip your back when you don't work hard enough. To be exploited means the wages don't grow with the grow of production and profit. So you can be exploited even if you have a nice house and a nice car if the owner of the mean of production who employs you gives you back in the form of a wage less than what your father and grandfather earn for the same amount of work. Today, the production have considerably increased since a century back. So we have the illusion that we are less exploited. Because everyone has a refrigerator, a TV, a dish washer, a washing maching. So the average proletarian say \"see, our grandparents and parents were way more exploited than us today\". However, it's just an illusion. Because the production considerably increase. E.G:  http://gouvernet.com/public/term/sources_et_limites_de_la_croissance/sourcesetlimitesdelacroissance_web_web/res/evol%20pte.jpg\n\nThere are more goods in the market, for a cheapest price. Thus proletarians thinks they are richer than their ancestors. In fact, they are way poorer, because the owners of the means of production take way more from their work, and give them back far less. Due to less paid labor for a particular amount of work. The mechanization, which increase the production and the prices of consumption goods, gives the illusion that the proletarians class is richer when in fact they are poorer. \n\nSocialism doesn't exist. The capitalist class always arm lock politicians. Almost always. When some politician is upright, the capitalist class get rid of him. With their controlled medias, they can make a scandal appear (see the recent news with Trump). Or they can have more radical means (Kennedy). \n\nThere isn't democratic control, because representative democracy is a deception. Representatives don't work for the people, but for the owners of the means of production who paid for their political campaigns. \nThe only democracy is direct democracy. \n\nAbout the State, it is an emanation of the capital. The Capital need the State, because it collect taxes, which is needed to pays the interests on the public debt. The state is also needed because it is needed by the capital to enforce the claims and the liabilities. \nIn History, when money appeared, a (primitive) state appeared. When there was no money (E.G: the german tribes until the 5 century A.D), there was no state. \nMoney and the state necessarily co-exist.",
				"added": 1476202871
			},
			{
				"comment_id": 16,
				"body": "> [planespherev2](#comment_14_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): It depend of what you call socialism. \n> I don't have in mind one single example of socialism in modern era. Most of the time, a political party call himself socialist but it isn't. See what happened in western Europe since the 80s. Never have been more socialist parties but the proletarians (salaried employees) have never been exploited. To be exploited don't mean you have a master who literrally whip your back when you don't work hard enough. To be exploited means the wages don't grow with the grow of production and profit. So you can be exploited even if you have a nice house and a nice car if the owner of the mean of production who employs you gives you back in the form of a wage less than what your father and grandfather earn for the same amount of work. Today, the production have considerably increased since a century back. So we have the illusion that we are less exploited. Because everyone has a refrigerator, a TV, a dish washer, a washing maching. So the average proletarian say \"see, our grandparents and parents were way more exploited than us today\". However, it's just an illusion. Because the production considerably increase. E.G:  http://gouvernet.com/public/term/sources_et_limites_de_la_croissance/sourcesetlimitesdelacroissance_web_web/res/evol%20pte.jpg\n> There are more goods in the market, for a cheapest price. Thus proletarians thinks they are richer than their ancestors. In fact, they are way poorer, because the owners of the means of production take way more from their work, and give them back far less. Due to less paid labor for a particular amount of work. The mechanization, which increase the production and the prices of consumption goods, gives the illusion that the proletarians class is richer when in fact they are poorer. \n> Socialism doesn't exist. The capitalist class always arm lock politicians. Almost always. When some politician is upright, the capitalist class get rid of him. With their controlled medias, they can make a scandal appear (see the recent news with Trump). Or they can have more radical means (Kennedy). \n> There isn't democratic control, because representative democracy is a deception. Representatives don't work for the people, but for the owners of the means of production who paid for their political campaigns.The only democracy is direct democracy. \n> About the State, it is an emanation of the capital. The Capital need the State, because it collect taxes, which is needed to pays the interests on the public debt. The state is also needed because it is needed by the capital to enforce the claims and the liabilities.In History, when money appeared, a (primitive) state appeared. When there was no money (E.G: the german tribes until the 5 century A.D), there was no state.Money and the state necessarily co-exist.\n\nEdit: The mechanization, which increase the production and lower the prices of consumption goods, gives the illusion that the proletarian class is richer than their ancestors because they have access to more consumers goods (a cheaper TV,  phone,  car etc...) when in fact they are poorer: the capitalist class take more of their work.",
				"added": 1476221545
			},
			{
				"comment_id": 17,
				"body": "> [shellbound](#comment_18_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): When the machines are capable to supply all of our human basic needs they could be made to do it gratis. The means of production will become autonomous. Work would be defined differently from today. If our basic needs are accounted for we don't really need to work... but still will. I envision a universal basic income that ensures people with what they need and a capitalistic layer above that ensures competition and pushes development forward. Poverty as such would be exterminated.\n\nI also see this king of full automatization. However the problem is the same: who will be the owners of these slave machines? Everybody or a handful of ultra-rich?\n\n> A problem with basic income is that it is not really equity but do simplify bureaucracy and would remove the ability for employers to push salaries down. \n\nI think basic income, if it is seducing at first, will create a third class of people. Today we have 2 classes. The capitalistic class: owners of the means of production, and the proletarians: the salaried workers.\n\nZbrezinsky Zbigniew wrote a few decades ago that only 20% of the population could make the whole system work. These 20% would be engineers, computer scientist, reserchers, and generally the people in intellectuals fields. For the 80% left, he proposed Tittytainment. \n\nA basic income would very well create a third class of people. So we will have the owners of the means of production (1%), the salaried workers: these 20% who'll make the system work, and the rest (about 80%) will be the basic income people. \n\nI don't know what you think about it, but for me it looks like this. \n\n> I am not sure if we ever can live state-less as we would always need some sort of law. People will always find ways and become in dispute with each other. It's part of our natural being. With laws you will need some way of enforcing them and that means you will need some sort of a state. This can't be shunned by simply getting rid of money. People will even in abundance still trade because it can never be absolute. You will always find scarcity. I don't see a point with removing a very effective way of exchange. I rather give someone \"money\" instead of dragging my cow to the market and trade it for the item I need to be able to get the item I want. Money doesn't have to be dollar it could just as well be a cryptocurrency.\n\nWe lived, as homo sapiens, 148000 years without money. \n\nThe state emerged when the primitive harmony was broken due to the Neolithic revolution. When humans began to store goods and keep it for themselves,  and not just take them from nature in immediately use/ eat them. \nWith all these new stocks, for the first time appeared (inside the tribe, not between rival tribes), theft. A society with such differences in wealth couldn't exist anymore in harmony. So written law was created, juridisdictions and police to enforce decisions rules by the judge. \n\nAgain, the german tribes, which were pretty evolve didn't use money until the 5 century A.D. Same examples with an other evolved civilization the Anasazis indians (puebloan indians): they didn't use money. \n\nScarcity is only in our heads. It's some kind of disease. The ones who want the most expensive car, or even computer or smartphone are retards anyway. They are alienated. They are others than what they really are, as humans. There isn't scarcity. Give me one example of something scarce really needed for a particular individual (except for health problems), which isn't greed. \nNature give us everything we need, and other stuffs, we have our brains to create it and then share it. \n\nDo you know how many different smartphones there is currently on the market? Thousands. This is madness. Only half a dozen different smartphone models would cover the need of every human on this earth. But greed, ego, want us to have the latest shiny shit.  What's more, with only a handful model, we could produce with enormous economy of scale, needing less people working for jobs they don't like (who like to built smartphones?).\n\n> @planespherev2: Direct democracy sound good in theory but in practice it is always the one who shout the loudest that win. Which means the minority will always be oppressed. Those with a weaker voice will thus have it harder to be heard. Also, do not apply US politics as a generalization. In my (and I believe most other) countries the politicians are paid by the state. So the \"owners of the means of production\" can't really pay the political campaigns. The representation is as such selected by those who vote. Also, most are not full time politicians but have regular jobs. They attend a committee a couple of times a year/month.\n\nIn a particular western europe country were i live, most know that the politics are in the pocket of the banks and the industry.  Maybe in small countries it's different. I heard Scandinavians country are pretty upright. But in this big western europe country were i am? Certainly not. They even have a \"club\" (like the bilderberg or the CFR) were all the politicians, industrials and journalists regularily meet and have wrotten guidelines in a fascimile. \n\nDirect democracy worked for more than a century in Athenes (5-6 century BCE).\n\nAlso, in Switzerland, there is an imperfect direct democracy: they have referendum based on poplar initiative. It works pretty well.",
				"added": 1476226050
			},
			{
				"comment_id": 18,
				"body": "> [japs](#comment_1_1Jqm5dUdtvmo1StgeVy3rk1BHRUrMkKawV): The Jews who provoked Japan into World War, then saw to it that Japan would be bombed with atomic bombs. Their intent was always to use Japan to destroy itself and as many other Gentiles as possible, while promising them world conquest.The Central Bank of Japan is controlled by Jews.Today, Japan is used the Jews as a pawn between China, North Korea, Russia and the United States.In 50 years in Japan will be only Jews and African slaves.Leading Jews are doing the same to America and Russia. If the most cities will be destroyed by nukes in a nuclear war, then they can buy everything very cheap.\n\nYou must be a troll.\n\nEven if this is true (some of your arguments have a bit of truth), then the Gentiles are really like the Talmud described them: animals.\n\nRemember: it is never the elites who fight the war: it is the people. They are too stupid, and are mislead by a promise of a greater tomorrow. \nIt is the people who consume all the garbage, and make the rich richer.\n\nAmong every jew hater here, how many grow their own food? How many are food self-sufficient because they grew their potatoes and vegetables? \nThat's right. Jew haters prefer to eat Jew Coca-Cola, eat jewish junk-food (coca-cola, Danone, Nestle, mac donald) have jewish cosmetics (L'oreal) instead of making their own ones, wearing jewish clothes and watching jewish movies.\n\nYes jews are responsible of a lot of things, the FED, and many americans presidents were killed by jew bankers.\n\nHowever, you guys are only feeding them by buying their shit.\n\nAgain: dispose of the jews, and are all of you jew haters stupid enough to think that the new elite will be considerably better? You're just dreaming. \n\nJew maybe corrupted the society. We saw it with feminism, LGBT, gender theory etc...\n\nBut who bought the lies? Your friends, family, co-workers, etc...\n\nSo if the world doesn't satisfy you, try to change it, beginning with your own habits, before blaming the jews.",
				"added": 1476230312
			},
			{
				"comment_id": 21,
				"body": "> [shellbound](#comment_19_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): \n> \n> That was an interesting take about it and it is definitely plausible. At least in the beginning it is very likely to be as that. Class are not determined after income though so salaries doesn't really matter in that sense. It is determined in influence over your own time or control over your situation. In that sense UBI will remove classes as you will no longer be controlled. \n\nOr it will be a tool to have even more control over the population.\n\nE.G: put that R.F.I.D chip under your skin or the state will cut off your basic income. \n\nThe hand that gives is always over the hand that receives (Napoleon).\n\n> Artificial scarcity as well as natural scarcity will continue to exist. Things people will continue to be prepared to trade for. It has not with basic human needs as those will be fulfilled by the automation and UBI. People will continue to want that specific book or that vintage vinyl. Things that have emotional value. \n\nNo emotional value towards goods in a true human society. This is alienation.  Primitive tribe don't fetishize goods.\n\nBest thing we could do with those things is to put them into museums. \n\n\nAbout representative democracy, it is a scam because people don't have any sort of control over their representatives. In a commercial society, for example, the board of directors can be removed at any moment by the shareholder. What's more, the company manager is responsible toward the shareholders if he doesn't manage the society well or does mistakes. \n\nOn the contrary,  in our representative democracies, representatives are totally immune. So they can serve the power that is (capitalistic class), without any trouble, they aren't responsible toward the people. \n\nDuring the Budapest commune (1956), workers took over the means of production, and the boards of directors were replaced with \"workers concils\". The representatives in these workers concils were responsible towards the workers, and the workers could also fire them up and replace them at any time, without any justification. \nThat, is exerting power towards a representative. \n\nToday, the workers concils concept is a little outdated,  with the possibility of direct democracy and liquid democracy in the internet era. However, you get the point. Total control over the representatives, or they can fuck themselves with their representative democracy.",
				"added": 1476311362
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 3,
				"body": "Right. Very true. Eustace Mullins and Douglas Reed are indeed interesting (for real). \n\nBut that doesn't solve the problem. \n\nSo you don't want the jews to control us. Great!\n\nYou want us to be self-controled, with currency.\n\nHow about NO control? \n\nRight, humans need to be controlled, or so we've been told.\n\nHow did it work for sapiens from 160000 BCE to 12000 BCE? \n\nCurrencies are chains.",
				"added": 1475941371
			},
			{
				"comment_id": 12,
				"body": "> [nigger1](#comment_2_1Bx1tNpf8HRG7FJpcuCVVasdma3CUaho9w): No, The American People will create the currency, fuck the Jews, we will never allow the Jews to create the currency and then have us borrow it from them, EVER AGAIN!!!! FUCK YOU JEW!!!!!\n\nWhat about no currency? What about an other mode of production? Why wanting a long leash instead of a short one? What about having no leash at all?",
				"added": 1476192025
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 4,
				"body": "> [joey1](#comment_1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA): At least to some degree, every Jew in the world has the mentality that their main goal is to subjugate, subvert, and enslave all other groups one way or another, this is because of their religious learnings.\n> The Jew mentality is the largest destructive force in the world today. Jews are running the Muslim Invasion.\n\nRight. \n\nIt would be so much better if our elite would be 100% good old christians. They would never subjugate, subvert and enslave all other groups, because they went to the good old church when they were young and prayed Jesus. So when one of these good christian elite become CEO of Monsanto,  Locked martin, Raytheon, he will just stop to sell poison and weapons of mass destruction. If he become a trader, he will stop to speculate on homes (2008 crisis), or food (starvation in the thirld world).\n\nI thought like you just a few years back. \n\nThe problem is not the capitalist ruling class religion or ethnicity (jews, satanists, soon Chineeses or whatever).\n\nThe problem is not the system's elite religion or ethnicity. The problem is the system itself: the money game. \n\nHomo sapiens is so brainwashed by the money game since thousands of years (it began 12000 BCE with the neolithic revolution). He has forgotten it is not his true nature.",
				"added": 1475942155
			},
			{
				"comment_id": 6,
				"body": "> [21x](#comment_3_1LtzSR6qY5YBVNfDvktEd7xHo7dwvE2zBf): This is a communist ideology invented by Jews. But you can still fool with it some people in the jungle of South America if you hurry.\n\nYou don't know shit. It's not the Jews who control the world. \n\nIf you think Rotschild, Rockefeller,  Schiff, Warburg and Morgan are Jews, then maybe they deserve to rule over you.\n\nJews are somehow linked to them but the average jew don't know shit, like you, and isn't part of the plot. \n\nIn fact jews in Europe during WWII were sacrificed by this elite because they weren't zionist enough.\n\nAnd about your Hitler, he was a pure creation of the Tavistock institute, MK ultra ancestor (still exist nowadays). Ouch, harsh for you isn't it?  \n\nGuess what? Their ultimate tool to control people isn't mass medias or the FED, but MONEY itself. You know that the bolshevik Lenin never intended to suppress money? In fact Lenin's new economic policy in the beginning of the 1920s was way more liberal than the tzar economic policy. \n\nOnce you guys understand this and concentrate your hatred towards money,  maybe we could do something. Hating the jew but still accepting Mammon. What an absurdity. \n\nUntil you change and accept to let go of the money game, they'll always rule over you.",
				"added": 1475969251
			},
			{
				"comment_id": 8,
				"body": "> [becoming](#comment_11_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Money is basically 'reputation points'. Banks become distributors, profiteers and creators of social reputation. \"In money, we trust.\" Like Gold and Silver of old, it served as a more light weight and liquid measure of value.\n> Money becomes its own person, out of nothing, which is trusted. It is a God in every scientific sense - it is the natural world which becomes personified. When one acquires money, they think of the power it has over people, not that it can provide for oneself. It cannot. You can't eat gold.\n> Hitler controlled money in Nazi Germany. It relied on trust toward the ones who control the money, that they would not manipulate it. Gold and Silver were essentially decentralized credit, because one could find it and 'strike it rich'. Not one group of person(s) controlled it or manipulated it. One had to at least, with gold, commit actual violence against the citizens in order for the gold market to be manipulated. With fiat currency, no over violence is needed to actually commit violence against them: one only tap-tap-taps into a computer one figure or another.\n> I'm not sure what a world without a currency would look like, except that there'd be bartering. Bartering is very inefficient. There used to be multiple currencies - but the banks kept having bank runs and crashing because they're greedy shits, so they said \"Let's create one huge bank for all of us to be greedy shits with\" and nationalized the currency. Now they're going to attempt to do the same by creating a global currency.\n> Rejecting money, the people will just return to the gold standard. So, I don't see you'd stop that. Gold or Silver, or some other thing will become the 'currency' of choice. What would stop banks from again issuing 'gold/silver notes'? Legislation?\n> If one just banned usury, this would be solved. Then you just get loan sharks, though.\n\nLike other guys, you want the society to be better, however, you're still infected by this shit we call money. Of course money is power over someone else. Whether money is created by a \"jew\" FED or backed by gold. \n\nIf you pay someone to clean your toilet, and he does it because he doesn't have a choice, it's this or sleeping on the street, you exert power over him. \n\nQuickly about Hitler, there are some sources that he was a Tavistock institute creature (but more research have to be done).\n\nBarter is a myth. It never existed. It was invented by Adam Smith and others like him. It's amazing how you guys denounce jews but still accept jew compatible theorists from old time like this Smith. So for you guys Marx is part of a jewish conspiracy to take over the world, but good old Adam Smith is pure as a white dove. He was for an honest capitalism, without exploitation of the working class.  Do you realize just how ridiculous that sound? \n\nAbout barter, the primitive tribes, inside the tribe, don't barter. They produce goods and share them between the people when there is a need for something. That's how the German tribes worked until the 5-6 century A.D. The lands, animals and tools were shared. They fought the Romans and sometimes, they won. Also money less systems existed in other civilizations. Money isn't necessary to civilization. Anasazis indians were a complex civilization without the use of money. Also, and i don't know if some of you are into it, but the pre-flood civilizations were probably moneyless societies. They didn't used money but build wonders like the great pyramid, Sacsayhuaman wall or (among other things) Teotihuacan.\n\nAbout usury, that's the problem most people can't understand, but it's pretty simple. If you have a money system, you'll have usury. It's just simple as that. In every 1 dollar bill, there is usury. \"Oh, you want 100 dollars? No problem! Take it, you'll give me 110 dollars in one month. \"\nOne good example is when usury was forbidden before the 18th century in western continental Europe (England was a little ahead if i remember correctly with the bank of England (1694), ancestor of the FED). So what happened in western Europe were usury was forbidden? Loans were just disguised, mostly with life annuity, which was legal. So the usurer gave money, in exchange for a life annuity for him. It is usury AND hypocrisy. In a sense, it's worse than legal usury. \nSame hypocrisy happen in muslims country with the Sharia. So usury is forbidden. Guess what the stupid hypocrites do? They lend money in exchange of a \"rent\". A rent is legal under such a sharia system. So it's legal for them to lend money in exchange of a rent, which is probably calculated with an interest rate. So the hypocrisy goes to the point were they use interest rate formulas, but in the \"sharia compatible\" loan  contract, the due is called \"rent\". \n\nDo you want such hypocrisy? \n\nI don't. \n\nLet's be ambitious. No half measures. No turning back in the 19th century capitalism. It won't even work since capitalism never goes back, but always further. The only solution is to go ahead of capitalism, to change the entire mode of production. Not to go back in our great  grandfathers capitalism.",
				"added": 1476014022
			},
			{
				"comment_id": 13,
				"body": "> [kosherx](#comment_18_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Why is it that ignorant people misunderstood right-winged state bullcrap with libertarian anarcho-capitalism? Why don't you study about the subject before saying something as stupid as this?\n\nAnarcho-capitalism is fashionable these days. Right, let's do it! Good idea! Let's rearrange capitalism once again! This time it will work! The capitalistic system is good, we just have to change it for it to be a wonderful society without greed, class, poors, super-richs, destruction of the environment.\n\nAs anarcho-capitalist, we know that money is mandatory for a society to work. What's more money is just a tool. Proof: i give a  hundred dollars a prostitute to suck my dick, see? It's just a tool. I do not exert a power over her. It just a neutral way to organize society. Same for the millions of people who have shitty jobs and hate their lives. With anarcho capitalism, they will be also paid with shitty wages, just enough for them to live, and they will work for the owners of the means of production, but with anarcho-capitalism, they won't be jews owning these means of production so it will be so much better! \n\nWhat's more, with anarcho capitalism, there will not be a few hundreds ultra rich on the planet, but at least 100000 very rich people, the money will be more equally distributed between the owners of the means of production due to more competition in the market! Fantastic! But hey, they will still be someone to clean the toilets and make me my  burgers in some shitty junk food restaurant, but if they are on the bottom of the ladder, it must be because they deserve it. \n\nLow class humans will always exist and will ever exist. These radical Marxists with their one class society are crazy. It never existed. Ok, they'll say it existed from 160000 BCE and 12000 BCE, for about 148000 years,  but they were just savages, living in caves, and hunting mammoths. They didn't have art, healers, harmony, abundance like us, nature never gave them everything they ever needed. I want my Coca-Cola and my iphone 7 god dammit! \n\nWith an Anarcho-capitalist society, imagine the dream society we will have! For the first time in 12000 years, since the Neolithic revolution,  a money-based society that is enjoyable for the people!  Join US!",
				"added": 1476193433
			}
		],
		"2_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 5,
				"body": "Again, you have only half right. The first half. \n\nInterest yourself about the elite surrounding Putin. \n\nI'm scared about all the elites. If only you knew what's in their head you'll never follow them. \n\nA direct democracy is indeed necessary to stop the nonsense you refered to. \n\nHowever, what would really be ambitious is to go even further: change the mode of production for one not based on greed.",
				"added": 1475950396
			},
			{
				"comment_id": 7,
				"body": "Also, as i said in an other topic, the central bankers (Warburg, Schiff, Morgan, Rotschild, Rockefeller) are not jews. \n\nSatan doesn't care if they have their foreskin or not. \n\nOk, i'll be more precise, they are Frankyists, Sabbateist, Kabbalists.\n\nAlso, there are way more gentile (non jews), working against you than you think. Probably more non-jews than jews working to reduce you as a slave, and later, as food.  \n\nThe demiurge has his chosen people. However, any piece of shit who willingly accept to serve him is welcomed. Hollywood and the music industry are good examples.",
				"added": 1475971076
			},
			{
				"comment_id": 9,
				"body": "> [peterrabbit](#comment_1_1MtCWSi2Y3ZyNGq3qU3WUQkAVGcfJKS3Ls): They are kabbalah following jews.\n\nYes, but be honest: do you really think that there isn't even more gentiles than jews who work against us? \n\nLook in the sky, see those chemtrails? Is every pilot of these planes a jew? \n\nIf the gentiles are so stupid, and corrupted to do everything just for a wage to buy them a nice car and a house with a swimming pool, than the jews should rule.",
				"added": 1476014362
			},
			{
				"comment_id": 15,
				"body": "> [nigger1](#comment_1_1Bx1tNpf8HRG7FJpcuCVVasdma3CUaho9w): I noticed this thread originally started as \"Russia is not the problem\" until some little Jew scumbag edited it to the way it is now.  Jew changed it to \"Russia who is the problem\".\n> So much for piece of shit ZeroNet !\n> This is why the Jews must kept out of all countries and all positions of power !!!!!\n\nI never said Russia is a problem. And you'll be surprised of my ancestry scumbag.\n\nNigger1: \"Jews are responsible of 100% of the shit that happen in the world. I'm responsible of 0%.\"\n\nWhen nigger1 eats his meat, he is not responsible of deforestation and pollution of the soil and over consumption of electricity. It's the jews who are responsible.\n\nWhen Nigger1 is in his car, he is not responsible for the microparticules he emits in the atmoshpere, and make sensitive to air pollution people sick.  it's the jews fault.\n\nWhen Nigger1 buy his Nike shoes, he is not responsible for child labor used to make them. It's the jews fault.\n\nI never said jews aren't responsible of anything, dirt bag. \n\nHowever, if we are to live better, everyone must change his dirty habits. \n\nI'm surprised that people like you are on Zeronet. You probably find out about it by accident.\n\nAlso i just noticed that you blamed ZeroNet :\"So much for piece of shit Zeronet\". This alone completely discredits you. \n\nYou realized you just blamed an open source P2P sharing system, a system working without anyone to operate it? You're just probably too stupid to realize how the Zeronet system works  anyway.",
				"added": 1476208350
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 10,
				"body": "> [21x](#comment_4_1LtzSR6qY5YBVNfDvktEd7xHo7dwvE2zBf): I am so disappointed of Trump. He capitulated in front of gays, feminists and Jews.Why needs somebody to apologize if he in a private conversation expresses his aversion towards  women with silicone breast ? I mean these are still humans to a certain degree but sexually are certainly not attractive to normal men. Even Jews know that.\n\nHe didn't capitulated in front of the Jews. He was always in their pocket from the beginning. Do you really think that one man can fight the AIPAC and be protected against the mossad? \n\nThat is what happen when you believe in representative democracy: disappointment. And it will happen again, and again. Until you realize that representatives don't defend the people interests.",
				"added": 1476014676
			},
			{
				"comment_id": 11,
				"body": "> [z2](#comment_3_16vpc1mSeaKRT5vcGYnopy2wNhM1djgipn): The end of the world is near. We are all doomed.Even Arnold Schwarzenegger is on their side.Gays, feminists with silicone breast, drones and terminators will kill the last human males.\n\nIt's only the corrupted west. Asia don't care about this feminist shit.",
				"added": 1476031037
			}
		],
		"1_1HRqipL1thbTsztjAvhN76qkzQBZ1k93nJ": [
			{
				"comment_id": 19,
				"body": "Mesh networks exist in theory. See the serval mesh on android. The problem is that people don't use them, mostly because they don't really understand the technology and the positive implication of P2P decentralized mesh. \n\nHowever, it's important to have ideas about them, they could be used in time, should censorship hit the internet globally in the future.",
				"added": 1476278486
			}
		],
		"1_1PXxt4z65p8H6xXh4zb7ahMtE7kfCRxgaq": [
			{
				"comment_id": 20,
				"body": "In fact it already exist since many years: freenet.\n\nSame principle, but the code of freenet is older so it's way slower.",
				"added": 1476299004
			}
		]
	},
	"comment_vote": {
		"16_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"1_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1
	}
}