{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {
		"1_1CZhapKybCk4VkGiSso1YzXZd1oG5C3oAw": 1,
		"1_19RagxAc2n7zYdfbfda2Zc4dRoHRJzyAxo": 1,
		"1_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"1_1NGtwPu16u2iVu35a6jwGF7ijxN6yUXaBA": 1,
		"1_1Kb4wAfZMYYdzW1Bng8uaVJtSLQXMdCsAB": 1,
		"9_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"1_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh": 1,
		"1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"7014_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"3_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"14_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": 1,
		"1_1J977d47QgTcnJwZ3u67h3wX9ysJTNpfLL": 1,
		"7019_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": 1,
		"1_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"4_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"1_1MasLuczfwx6JzgRkwdH6fpR1rKK8sDwZ1": 1,
		"1_1JXFzMzrQTJCiGw36YNQGg2Tmt1hTHy7ZT": 1,
		"2_1JXFzMzrQTJCiGw36YNQGg2Tmt1hTHy7ZT": 1,
		"7029_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"7036_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"1_19GDcmuGz3D2epgu9k65yMY9WMYDG8eZCP": 1
	},
	"next_comment_id": 32,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "What the fuck did you just fucking say about me, you little shit? Ill have you know I graduated top of my class in the Navy Seals, and Ive been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and Im the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. Youre fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and thats just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldnt, you didnt, and now youre paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. Youre fucking dead, kiddo.",
				"added": 1469630271
			}
		],
		"1_1CZhapKybCk4VkGiSso1YzXZd1oG5C3oAw": [
			{
				"comment_id": 2,
				"body": "https://youtu.be/D-x9Ob7kktE",
				"added": 1469687295
			}
		],
		"1_1NGtwPu16u2iVu35a6jwGF7ijxN6yUXaBA": [
			{
				"comment_id": 3,
				"body": "You only have CP on your computer if you activate a CP site from my understanding.",
				"added": 1469722160
			}
		],
		"1_1Kb4wAfZMYYdzW1Bng8uaVJtSLQXMdCsAB": [
			{
				"comment_id": 6,
				"body": "Farmer, be careful those are a national security risk for the Russian. Putin might send FSB after you. Et tu Putin?",
				"added": 1469722858
			},
			{
				"comment_id": 29,
				"body": "I think farmer: went MIA. He took zeronet for a spin and never came back.",
				"added": 1469972121
			}
		],
		"1_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh": [
			{
				"comment_id": 5,
				"body": "> [mhxqufqlnn2ocw2z](#comment_1_19RagxAc2n7zYdfbfda2Zc4dRoHRJzyAxo): Does this mean that ZeroTalk's zite owner could effectively censor content on the platform? Or is user generated content stored separately, out of the control of any one person?\n\nYes only site owner can moderate. No user generated content is under control of site owner otherwise that wouldn't make any sense. Imagine any site getting spammed with CP.",
				"added": 1469722321
			}
		],
		"1_14Ph48APoNHojAArCqa6FAwXiobE9JByCy": [],
		"9_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": [
			{
				"comment_id": 11,
				"body": "ya the troll is a loser. Ignore trolls, do not reply to trolls. ",
				"added": 1469733520
			}
		],
		"7014_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [],
		"1_1J977d47QgTcnJwZ3u67h3wX9ysJTNpfLL": [
			{
				"comment_id": 12,
				"body": "I love play http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1469784409
			},
			{
				"comment_id": 13,
				"body": "> [tkarita](#comment_6_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): I miss KAT's RSS feeds.  I hope someone has a copy of Torcache.  A lot of material was lost when that went offline.  According to TorrentFreak, Artem Vaulin is defended by Ira Rothken, who seems optimistic about his case being dismissed.  The amount of money Vaulin is accused of laundering makes it difficult to believe he'll escape.\n\nYeah I miss them too, but, Peter Sunde made a good point torrent sites need to evolve and modernize. Play is a perfect example of a next generation torrent site.",
				"added": 1469784491
			}
		],
		"1_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": [
			{
				"comment_id": 14,
				"body": "> [quarkgate](#comment_14_12GC9MQGPcN7PiMoRYVyZX66PnQjZKUpf2): You make a good point. The problem is that people like the kat founder keep getting caught. Their websites keep getting compromised when they get taken down. Our privacy suddenly amounts to nothing, and the people who run these sites basically lose all their money and spend years in prison.But if no one made any money, there would be almost zero incentive for these sites to be taken down.This leads me to believe that ZeroNet or something like-ZeroNet is the only option for ending that vicious cycle.Because, no server costs, no domain costs, the users are the website, can't be taken down, almost no monetization options.\n>But if no one made any money, there would be almost zero incentive for these sites to be taken down.\n\nQuarkgate I have to disagree, a huge pressure is not from watching people gain financially but by MPAA and Hollywood refusing to adapt their business  models and lobbying for these arrests. \n\nRunning a torrent site is more of  an activist program then a monetary one. For the risk and work it pays very little.\nAt least that is what I understood most torrent admins to be activists that believe in open information.",
				"added": 1469784895
			},
			{
				"comment_id": 18,
				"body": "> [quarkgate](#comment_15_12GC9MQGPcN7PiMoRYVyZX66PnQjZKUpf2): Supposedly, Kat made 20m dollars a year. Piratebay makes 200m dollars a year.Personally, I can't even fathom anyone making 200 million a year.Even if it was just 1,000,000$ a year, what you say about it pays little is way off.As for high risk, sure. It's high risk. It also pays insanely to very few people. The mods probably just get a wage. But someone up there is raking all the money. \n> Hollywood and MPAA don't sue a thousand people for seeding a torrent. They sue the guy who makes all the money from it.\n\nI recommend listening to  https://torrentfreak.com/steal-show-s01e14-kickasstorrents/ which this discuss this very topic precisely. \n\n\"In this episode of STEAL THIS SHOW, we invite Peter Sunde, co-founder of The Pirate Bay, Andrew Norton, US Pirate Party chairman, and Gary Fung, founder of isoHunt, to discuss this critical event, its significance for the torrent community, and implications for the world of P2P. \"\n\n They are definitely well versed and experts in this subject.They go over it in detail better than I a regular user ever could. Also this podcast if how I discovered play, a great podcast to keep up with the pirating community.\n\nIf your busy I will try to sum up what they said.\n\n1 - Those figures are estimates\n2 - They don't account for any cost of doing business which is huge. Server costs, CDN, staff etc...\n3 - If it were very lucrative a lot more people would run these huge sites.\n\nThey must make some money, but, how much is not entirely clear.",
				"added": 1469786671
			},
			{
				"comment_id": 21,
				"body": "> [quarkgate](#comment_16_12GC9MQGPcN7PiMoRYVyZX66PnQjZKUpf2): That's a nice podcast. did you listen to 13:36?  He asks \"Do you have 150m$ lying around?\" \"No comment.\"That guy was a political figure that was supposed to be transparent.Estimates are very high, and the fact is they do make some money. And they're not very transparent about how much. So let's face it. \"Gary\" probably has millions of dollars lying around.\n\nI think he refrained from commenting because he is under a legal payment plan and that could be used in court of law against him. Listen it is very possible, we just don't know. No one is going on the record. I just would imagine more competition if they were earning millions of dollars.",
				"added": 1469792883
			}
		],
		"1_1LJLVfT9hKRuTHzBKTpse57PGfpwx82myR": [
			{
				"comment_id": 15,
				"body": "You know, they should probably have a sub forum on zerotalk for all feature requests. Great work devs! Love the platform so far. Everyone I show, is hooked on zeronet.",
				"added": 1469785126
			},
			{
				"comment_id": 19,
				"body": "This post is related to http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH/We+need+a+reputation+system",
				"added": 1469788878
			},
			{
				"comment_id": 22,
				"body": "> [tkarita](#comment_8_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): ..wait, what?  I'm not offended; I was suggesting a tag system could be helpful for tracking related-ness within this forum.  Combining that with a vote/reputation system could avoid some of the problems with single up/down counters that Reddit has.\n\nOh I am so sorry! I guess I am the one that needs sleep. I feel like a fool! Poe's law in reverse. I will remove it, I am really embarrassed. Sorry again.",
				"added": 1469795485
			}
		],
		"7019_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 16,
				"body": "I am not an economist, but,  this is a perfect example of over regulation.\nIn a regulatory Catch-22, as part of their “de-risking strategy,” banks need FINTRAC to define digital fintech startups as money services businesses before they can offer a business account.\n\n“Regulators such as FINTRAC and the Office of the Superintendent of Financial Institutions (OSFI) are known to have relatively negative views of MSBs (whether this is organization-wide or the bias of some examiners I cannot say),” said Scott, “which makes me wonder if the MSB designation will do more harm than good when it comes to the ability of Bitcoin companies to access the traditional financial system.",
				"added": 1469785450
			}
		],
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 17,
				"body": ">I've seen people on Reddit go through people's post histories and downvote them based on comments made in the past. In another thread or in another community entirely. It's pretty ridiculous\n\nI hate that about Reddit. You say something I don't agree with, let me comb all your history to attack you personally so I don't have to address your idea. You could eliminate that problem by disabling user history and searching for users posts.\n\nI think you need an important balance between Reddit and the Chans. When you add a point system, you limit the capacity for discussing as all the controversial ideas are muted and the community becomes a huge echo chamber.",
				"added": 1469786312
			},
			{
				"comment_id": 31,
				"body": "squeezit : Ya me to, it will come. Do you have any ideas of other stuff you would like on 0net?",
				"added": 1470090995
			}
		],
		"4_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": [],
		"7024_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 24,
				"body": "It doesn't say if the guy got his 28 000 back. I wonder if he got it back.",
				"added": 1469808852
			}
		],
		"1_1JXFzMzrQTJCiGw36YNQGg2Tmt1hTHy7ZT": [
			{
				"comment_id": 25,
				"body": "You can chat, discuss on forums, download torrents, search, create your site, use email. Or build something new. Go to 0list for a list of all the sites. I saw you on the chat. I just replied.",
				"added": 1469829193
			}
		],
		"2_1JXFzMzrQTJCiGw36YNQGg2Tmt1hTHy7ZT": [
			{
				"comment_id": 26,
				"body": "Hey mate. I am online.",
				"added": 1469829228
			},
			{
				"comment_id": 30,
				"body": "hey flux: hows it going man?",
				"added": 1469972143
			}
		],
		"7029_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 27,
				"body": "Thank you for sharing zeronews, really interesting.\n\nFrom what I see ISIS is just doing OPSEC, 101, especially if your an enemy of the state. Not really impressed, it's not like they built any of these tools.  They are not launching any cyber attacks. They just scramble their gps and ip information with Western products and use encrypted communication to communicate. \n\nAlso It has been well documented that most of the time, the intelligence agencies have intercepted clearnet data, but, since they collect so much they can't analyze it properly. I just hope they don't use this as evidence to ban, vpn and encryption.",
				"added": 1469829810
			}
		],
		"1_17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL": [
			{
				"comment_id": 28,
				"body": "zer0sum: They got one up and running. \n\nhttp://127.0.0.1:43110/1AvF5TpcaamRNtqvN1cnDEWzNmUtD47Npg/\n\nThe people behind zeronet are really doing a fantastic job. \n\nI like that everything so easy, maybe they understand that p2p service needs to be able to used by normal non tech users such as me.",
				"added": 1469971979
			}
		]
	},
	"comment_vote": {
		"23_1GCMDNMgJHvZJfdbD9ygDmpBdnVAobdJYg": 1,
		"705_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1Kb4wAfZMYYdzW1Bng8uaVJtSLQXMdCsAB": 1,
		"41_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"6_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"37_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"36_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"10_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"1_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"707_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"4_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"6_1KnFgYp6rbz2VLe4H7RW36J8ChSqHSbxLn": 1,
		"5_1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv": 1,
		"1_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF": 1,
		"15_12GC9MQGPcN7PiMoRYVyZX66PnQjZKUpf2": 1,
		"6_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"77_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"78_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"14_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF": 1,
		"2_1Fpr6zPwHnEmQMXsuEcCZL35GJg1vvifW": 1,
		"708_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"19_1Buq4fyG8B3MxAvs7h4bASyWbrKFxmg4CJ": 1,
		"1_14VvEdWZ8gq5e432tE1mdhVyGXvtBV7yCn": 1
	}
}