{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_16urzDUk5S1EYSaL8XGaJav7BicYSnsxe3": 1,
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"10_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"3_17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL": 1,
		"3_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"2_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": 1,
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": 1,
		"1_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"19_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"3_19M1DT5vruSATEcbEczYRwCk2uPuLcATBa": 1,
		"2_16YP1ZeHrKq3KB3DdBWHec984oQAfVPT9d": 1,
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"2_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1,
		"4_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_16urzDUk5S1EYSaL8XGaJav7BicYSnsxe3": [
			{
				"comment_id": 1,
				"body": "Maybe.. I am a fan of Minetest but I couldn't find the license for Magichet. I am not a fan of someone taking open source and then closes it. I would gladly pay if it is still open source.",
				"added": 1470512797
			},
			{
				"comment_id": 2,
				"body": "Seems like the author say it is LGPL and that they intend to release the sources of the code. They will however copyright some of the textures. I am alright with that. \n\nThe saddest part (like always) is how many idiots there are in the comments section. Are people just unaware of Minetest. Do they not know what Open Source is? Calling it Minecraft and a clone is just making a fool of themselves.",
				"added": 1470518642
			},
			{
				"comment_id": 3,
				"body": "Minecraft is a so called voxel-based sandbox mining game. Kinda like how RPG is describing another type of games. You wouldn't call one RPG game a clone of another RPG game just because they have the same basics. Minetest is only inspired by Minecraft. They still have their differences. Minetest is also open-source which means everyone can improve upon it and that it is free to play. Look up Infiniminer which inspired Notch to make Minecraft. Minecraft was not first in this genre.",
				"added": 1470524883
			},
			{
				"comment_id": 4,
				"body": "@quadrangle: If you didn't grasp my last post I don't know how to break it down for you any further.. Do you call Minecraft a Infiniminer clone? No, you don't. Would you call Asphalt a clone of NeedForSpeed just because they both have cars following a track? I'm betting you aren't. You shouldn't for Minetest neither. They are simply only in the same genre.",
				"added": 1470530210
			}
		],
		"1_15JuC9Nz1ua8s7M7tUemvJN1r6NZhffCVq": [
			{
				"comment_id": 5,
				"body": "You mean like this...\n\n...it is with shift+enter",
				"added": 1471904750
			}
		],
		"1_1Gb4DzrdjGBCiTnVyZRB2CHfdSnBfb4FY1": [
			{
				"comment_id": 6,
				"body": "Wouldn't trust TrueCrypt and full disc encryption only protects while the machine is off... `shred` is a good tip though.",
				"added": 1472034132
			}
		],
		"3_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 7,
				"body": "How about setting up a poll about it http://127.0.0.1:43110/ZeroPolls.bit/",
				"added": 1472040094
			}
		],
		"7_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 8,
				"body": "This might help you... [How to change your ZeroMe Hub](http://127.0.0.1:43110/blog.kaffie.bit/?Post:25:How+to+change+your+ZeroMe+Hub)",
				"added": 1472158998
			}
		],
		"2_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": [
			{
				"comment_id": 9,
				"body": "Compared to the psychos of Trump and Hillary.. Jill is the sane choice.",
				"added": 1472887712
			},
			{
				"comment_id": 10,
				"body": "Compared to the psychos of Trump and Hillary.. Jill is the sane choice.",
				"added": 1472887755
			},
			{
				"comment_id": 12,
				"body": "> dldx: If I lived in the US, I would as she's the only sensible candidate although I wish she'd stop talking about anti-vaccine crap.\n\ndldx: She is not anti-vax... she just want to investigate big corps influence over the FDA. She has refuted it many times. It is basically just a lie.",
				"added": 1473282797
			},
			{
				"comment_id": 13,
				"body": "A bit sad to see some of the comments in here.. wished people could behave a bit more grown up.",
				"added": 1473282944
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 11,
				"body": "An image paste zite maybe.. one that have support for a client. So that I for instance could post a screenshot from the command-line and it would give me a url to share.",
				"added": 1473191671
			}
		],
		"5_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 14,
				"body": "I do torrents because it is more convenient for me.. the low cost is just a plus. I did Netflix but it was lacking too much content to be worth it for me.",
				"added": 1474972307
			}
		],
		"10_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 15,
				"body": "I don't know if a \"Kickstarter\" without funds as that is really needed or would help much except maybe in promotion. However something I do think people could find interesting is donating storage. Not sure how that would work but basically you allow for extra space to be used on your machine. Like a storage credit kind of system.",
				"added": 1475259122
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 16,
				"body": "@kosherx: Yeah, Karl Marx predicted this centuries ago... this is an inbuilt flaw in capitalism. Deuche Bank is in trouble too and if it goes down things will be pretty dire. It would probably be a worse crash than Lehman Brothers of 2008. Also there is no wrong in having private property. You seem to shrouded in faulty propaganda. The libertarian policy didn't go so well in Honduras did it?\n\n@planesphere: You are right. It was not communism. Communism is the state when no classes exist. Which surely it did in those systems.",
				"added": 1475845596
			},
			{
				"comment_id": 17,
				"body": "> [kosherx](#comment_8_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): First, I find it quite funny someone who comes with marxism mumbo-jumbo claiming that I'm into faulty propaganda, since Marx didn't predict this and even didn't live by his own words being supported by his wife and later by Engels, never working in his whole life. Anyone can predict economic crisis, but Marx never admitted that his claims against capitalism were responsible for them, exactly like Deutsche Bank, exactly like BOJ and exactly like the 2008 USA subprime crises caused by the socialist big government.Second, I never saw a libertarian claiming Honduras is \"a libertarian paradise\", quite the contrary.https://mises.ca/since-when-is-honduras-a-libertarian-paradise\n.\nMy point with Honduras was to show you that what other people proclaim about something (like Libertarianism or Communism) does not necessarily have to be true. I would view Honduras as big of libertarian dream as I see USSR a Communist one. None of them are really true for either ideology. Honduras did however do experiment with neoliberal reform that did pretty much explode in their face. This was partly behind the reasons for the coup.... The elected president didn't want these reforms and was therefore dethroned.\n.\n...and when it comes to Karl Marx. Many national economics admit he did explain the issues of capitalism pretty well today. While he looked dead wrong in the 80's he today 2016 looks much more in line. Stuff like the income gap and increasing inequality. Like that the 1% owning more than half of all the wealth, the disappearing middle class, crashing economy e.t.c.. Things which simply can be said is very much true today. We have an enormous gap and it is increasing. Greed is making the economy crash. Same inequality existed during the industrial capitalism he lived under as with the financial capitalism which we lives in. The big destruction of capital of the world wars hid a 30 year anomaly that made it look like Marx was wrong.. but it has corrected itself today. \n.\nFor the record.. I don't see myself as an Marxists. Yes, I have an egalitarian leaning but rather think of a mixed economy than a pure socialist or capitalist one. The current paradigm shift driven by automation is of particular interest of mine.",
				"added": 1475878048
			},
			{
				"comment_id": 18,
				"body": "> [tempcom](#comment_1_1KY97qn2wAVxSVTJ3fg8HvxwcJ7rwrPmt4): I think you have fallen prey to thinking of socialism as state ownership or intervention.Socialism is the democratic control over the means of production.Socialism and Capitalism cannot coexist.\n\nAs an egalitarian I am not signing up on a specific ideology in the sense that I swallow it fully. For me it's rather about equality and more specifically equity. I think Marx was somewhat right when he talked about Dialectical (Historical) Materialism. With the addition that I think we will rather evolve into a kind of slave economy where the slaves would be machines instead of workers. When the machines are capable to supply all of our human basic needs they could be made to do it gratis. The means of production will become autonomous. Work would be defined differently from today. If our basic needs are accounted for we don't really need to work... but still will. I envision a universal basic income that ensures people with what they need and a capitalistic layer above that ensures competition and pushes development forward. Poverty as such would be exterminated.\n\nA problem with basic income is that it is not really equity but do simplify bureaucracy and would remove the ability for employers to push salaries down. If you have a bitch employer you could always just take the basic income in the mean time and find another employer that respects you better. You could also use it in cases like if you want to care for your elderly mother, get an education e.t.c.. A progressive taxation would ensure the equity. With time we would be less and less dependent on the state and more and more able to live decentralized and off-grid. We would as such be untangled from the grasp of class. It would in a sense be optional. \n\nI am not sure if we ever can live state-less as we would always need some sort of law. People will always find ways and become in dispute with each other. It's part of our natural being. With laws you will need some way of enforcing them and that means you will need some sort of a state. This can't be shunned by simply getting rid of money. People will even in abundance still trade because it can never be absolute. You will always find scarcity. I don't see a point with removing a very effective way of exchange. I rather give someone \"money\" instead of dragging my cow to the market and trade it for the item I need to be able to get the item I want. Money doesn't have to be dollar it could just as well be a cryptocurrency.\n\n@planespherev2: Direct democracy sound good in theory but in practice it is always the one who shout the loudest that win. Which means the minority will always be oppressed. Those with a weaker voice will thus have it harder to be heard. Also, do not apply US politics as a generalization. In my (and I believe most other) countries the politicians are paid by the state. So the \"owners of the means of production\" can't really pay the political campaigns. The representation is as such selected by those who vote. Also, most are not full time politicians but have regular jobs. They attend a committee a couple of times a year/month.",
				"added": 1476221386
			},
			{
				"comment_id": 19,
				"body": "> [planespherev2](#comment_17_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): I also see this king of full automatization. However the problem is the same: who will be the owners of these slave machines? Everybody or a handful of ultra-rich?\n\nI think it will land on everybody eventually but it might need a revolution. I think we will see more extreme inequality before it can turn to the better but there is no escape that it will in the end. There is of course also the reformism way which should not be disregarded.\n\n> I think basic income, if it is seducing at first, will create a third class of people. Today we have 2 classes. The capitalistic class: owners of the means of production, and the proletarians: the salaried workers.\n> Zbrezinsky Zbigniew wrote a few decades ago that only 20% of the population could make the whole system work. These 20% would be engineers, computer scientist, reserchers, and generally the people in intellectuals fields. For the 80% left, he proposed Tittytainment. \n> A basic income would very well create a third class of people. So we will have the owners of the means of production (1%), the salaried workers: these 20% who'll make the system work, and the rest (about 80%) will be the basic income people. \n> I don't know what you think about it, but for me it looks like this. \n\nThat was an interesting take about it and it is definitely plausible. At least in the beginning it is very likely to be as that. Class are not determined after income though so salaries doesn't really matter in that sense. It is determined in influence over your own time or control over your situation. In that sense UBI will remove classes as you will no longer be controlled. You will however not necessary own the means of the production either. For that we will have the open source and open hardware movement. An issue for open source today is that is very difficult to find a funding model that work. With UBI that will be solved. With time the means will have transferred to the public domain.\n\n> We lived, as homo sapiens, 148000 years without money. \n> The state emerged when the primitive harmony was broken due to the Neolithic revolution. When humans began to store goods and keep it for themselves,  and not just take them from nature in immediately use/ eat them.With all these new stocks, for the first time appeared (inside the tribe, not between rival tribes), theft. A society with such differences in wealth couldn't exist anymore in harmony. So written law was created, juridisdictions and police to enforce decisions rules by the judge. \n> Again, the german tribes, which were pretty evolve didn't use money until the 5 century A.D. Same examples with an other evolved civilization the Anasazis indians (puebloan indians): they didn't use money. \n> Scarcity is only in our heads. It's some kind of disease. The ones who want the most expensive car, or even computer or smartphone are retards anyway. They are alienated. They are others than what they really are, as humans. There isn't scarcity. Give me one example of something scarce really needed for a particular individual (except for health problems), which isn't greed.Nature give us everything we need, and other stuffs, we have our brains to create it and then share it. \n\nArtificial scarcity as well as natural scarcity will continue to exist. Things people will continue to be prepared to trade for. It has not with basic human needs as those will be fulfilled by the automation and UBI. People will continue to want that specific book or that vintage vinyl. Things that have emotional value. \n\n> Do you know how many different smartphones there is currently on the market? Thousands. This is madness. Only half a dozen different smartphone models would cover the need of every human on this earth. But greed, ego, want us to have the latest shiny shit.  What's more, with only a handful model, we could produce with enormous economy of scale, needing less people working for jobs they don't like (who like to built smartphones?).\n\nThis is an argument I believe came up as a response to the inability of USSR. Choice is never bad.. as long as it can be made environmentally friendly. It is very important when it comes to innovation. This is very apparent in the open source world for instance. With 3d-printing this will only grow.\n\n> In a particular western europe country were i live, most know that the politics are in the pocket of the banks and the industry.  Maybe in small countries it's different. I heard Scandinavians country are pretty upright. But in this big western europe country were i am? Certainly not. They even have a \"club\" (like the bilderberg or the CFR) were all the politicians, industrials and journalists regularily meet and have wrotten guidelines in a fascimile. \n> Direct democracy worked for more than a century in Athenes (5-6 century BCE).\n> Also, in Switzerland, there is an imperfect direct democracy: they have referendum based on poplar initiative. It works pretty well.\n\nWhat has this with representative and direct democracy to do? Switzerland in particular is known for this informal power use thanks in part to their banking industry. Clubs like that existed before modern politics and direct democracy is no real deterrent... rather the opposite. Transparency is probably the best tool to fight this sort of thing.",
				"added": 1476299238
			}
		]
	},
	"comment_vote": {
		"7_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"15_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi": 1,
		"6_1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv": 1,
		"133_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"32_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF": 1,
		"12_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"11_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"19_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"21_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"770_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"210_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1,
		"16_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"11_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1,
		"1_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1,
		"19_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1
	}
}