{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "It's Time That The Basics Of Life Become Free And OpenSource. Electricity And Water Should Be Considered Basic Human Requirements And Be Provided Free For All",
			"body": "",
			"added": 1470663431
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"24_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 1,
				"body": "> [decentralizedid](#comment_3_13hcYDp4XW3GQo4LMtmPf8qUZLZcxFSmVw): I feel the same way... it's mostly because most people nowadays lack critical thought, live in a filter bubble, and only care about entertainment.\n\nBam!! Man oh man, you hit that nail so hard...",
				"added": 1468932902
			}
		],
		"1_1Dj5WCaPV2r18QcDQFHmyx2HnGmwMJce9b": [
			{
				"comment_id": 2,
				"body": "I'm not too sure if you guys are aware, but Nikola Tesla accomplished this very task with his Wardenclyffe Tower, but was shut down and made a pauper when his investors asked how they were going to charge customers. His reply was, this is his gift to mankind. So, you don't be naive or shortsighted in your thinking. Our right to not just exist, as economic slaves, but to live as free human beings must never be reduced to an excuse for the so called producers. What are you ants? The technology to draw water out of the air is there. The technology to convert static electricity from the air into current for your home is also there. And if this is to extreme a step, then in the same way taxes are paid for government services, then why not for electrical and water services? In my view, Water and Electricity have been around for well over a hundred years, and it is time, that both be considered a Human Right. How much more productive, and farther would we, as individuals, and as a race go, if we didn't have to worry about such things as water or electricity. The rich, and the politicians don't worry about those things, because the rest of us pay for them. For Politcians, this is a benefit for serving the people and as for the rich, when you buy their products or services, you are bascially sustaining them.",
				"added": 1470923088
			},
			{
				"comment_id": 3,
				"body": "Well thank God the rest of the Cosmos doesn't see things our way. I'm sure, they're waiting for us to see things their way, and they're working towards those goals, at a heightened pace, all now. Ya'atay. That's good.",
				"added": 1471026801
			},
			{
				"comment_id": 6,
				"body": "> [graveyardswatch](#comment_26_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF): From your saying, I am not sure you really have a God or faith within, might be just some naive wishful thinking derived from incapacity of self-esdeem.\n> What You do in this thread is ONLY putting the responsibility on anything except yourself, and God, Cosmos, and Humanity, are mere words to you and can mean anything you wish at any moment, which, ultimately, might indicate something that is really harmful rooted deep in your psyche.\n\nDespite your attempt at labeling me as some freak or nut, let me assure you I'm far, far from that which you seek. Hitler had people with Phd's and Masters degree's working day and night for him, look where they got him. The Titanic was built by people with Phd's and Masters degrees as well, and look where it is. So, who then was Noah, that built an Ark, that rests on top of a Mountain. That's a powerful message for people like you!",
				"added": 1471098876
			},
			{
				"comment_id": 7,
				"body": "The emblem for the ideals and the hope of Communism, since the time of Nimrod and the Tower of Babel is that of a rising sun, over a New World Order where man is no longer able to freely choose for himself, but made to submit his freewill to that of a fictional entity, that has no blood, no flesh, knows no mercy, has no thought, or consideration other than \"precedents\" and fixed odds against free willed Human Beings. You are no longer in control. If it's change you want to believe in, then it's change on terms of free Human Beings that should stand above all fictions and in the face of that which glitters, but is no authority over and above man. Man has been sufficiently instructed prior to birth and knows, as does every living creature, that the ability to choose freely is, literally, a Universal Right of existence without any conditions or constraints. The idea of free energy for all sounds foreign and infringing to commerce, yet it exists inside of us all, throughout the solar system, and more so in the center of the galaxy, where darkness does not exist. Most of us, desire to live peacefully, being happy, and having many joyous moments without any stress or having anything to worry about. We enjoy experiences and grow out of them and the challenges they present. \"Nothing is free in life\" is a demoralizing and a mind control conditioning statement. To put things in perspective, who pays for your beating heart, and your creative thoughts, or the electrical synapses that move you when you want? Who pays for the life giving Sun, the tree's that grow, the oxygen that you breathe, or even the beauty of nature that you can see with your eyes? Who pays for the water that falls from the sky? The fish in sea, how did they get there? Who pays to put the fruits on the tree, or  the vegetables in the wild? That's free energy! We are entitled free energy as well because it exits in such abundance. It's all around us, and it is not foreign at all. It is natural as the air you breathe, and the wind you feel.",
				"added": 1471101614
			},
			{
				"comment_id": 8,
				"body": "> [graveyardswatch](#comment_28_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF): Better seek professional help now, before it's too late.\n> According to all high school textbooks, the center of the galaxy is a Black Hole, I guess the Event Horizon awaits you light seekers. \n> Bon voyage! Messieurs et Mesdames.\n\nNo, the center of the galaxy is filled with light. There are lots of pictures of galaxies that clearly show you a brighter center. If there is a black hole in the center of the galaxy, you must looking at a picture of your asshole. \"Those aren't pilllows!\" lol...",
				"added": 1471286187
			}
		],
		"1_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF": [
			{
				"comment_id": 4,
				"body": "Well, here they come. These fucking people never rest. This request for blacklisting and such, can be compared to the FBI asking Apple for a backdoor into this one phone, and that's all it will take. Remember, they use such things like the Hegelian dialectic, Problem-Reaction-Solution. Give them a few months to find a way to create the problem on Zeronet, then when \"we\" react for a \"solution\" to the \"problem\", they come with the already made Solution, and they get exactly what they wanted, even though we told them \"NO!!\" already. Those little fuckers...",
				"added": 1471027235
			}
		],
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 5,
				"body": "No. I don't think we need that here. As individuals, we can self censor what we want, when we want. We do not need, nor do we want, nor should we encourage any of George Orwell's 1984 political correctness concoctionary bullshit. If you feel the need for such a thing, then do this for your own little zeronet site.",
				"added": 1471027496
			}
		]
	},
	"comment_vote": {
		"3_13hcYDp4XW3GQo4LMtmPf8qUZLZcxFSmVw": 1,
		"143_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"17_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": 1,
		"1_17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL": 1
	}
}