{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Could anyone send me a ZeroMail?",
			"body": "http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?Send&to=assman",
			"added": 1465907448
		},
		{
			"topic_id": 2,
			"title": "Why GPLv2?",
			"body": "@nofish, why GPLv2 and not AGPLv3+, GPLv3+ or even LGPLv3+?",
			"added": 1465939750
		}
	],
	"topic_vote": {
		"1_19hZjnvGuFY2sB3nDpX6869nJgkXURTvxX": 1,
		"1_1FoCQCBaoX3Fi85goewPLRLr1mxFqmCKNU": 1,
		"1_1NfrEAWyRckTcUHXcPNYBwkKWfvYDeRaF7": 1,
		"1_17dEBAxTcyJg38KfNtCvYWp7fddLKHv4rc": 1,
		"6212_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"2_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"8_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": 1,
		"1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"4_178NSuZP2hH2vHhNX6vsHceh5sjPkDrLiH": 1,
		"1_139X4c3WFVtmsEj6Vpdd74YY49ettpduKq": 1,
		"5_178NSuZP2hH2vHhNX6vsHceh5sjPkDrLiH": 1,
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": 1,
		"1_1DL96EbPqBXweqPPseW2eRCLF1EED73htn": 1,
		"1_175A4pxQi9MxM3im5oWZGqZPTyVWXQA6Bw": 1,
		"4_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"6251_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"4_19R2USgb9vPyg1jPQEJkGVoBwDuDcEmHRF": 1,
		"1_1LrJ9rZg2Mk2uK8MyPx42iWPEHTLKXzxVn": 1,
		"7_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1_19hZjnvGuFY2sB3nDpX6869nJgkXURTvxX": [
			{
				"comment_id": 1,
				"body": "שלום אחי",
				"added": 1465753209
			},
			{
				"comment_id": 2,
				"body": "קליעים בקנה\nבנות בצריח\n\nhttp://127.0.0.1:43110/danknet.bit/?/dank/thread/61bdd9e5ac76e7ffcd6986db5878c1a9\nhttp://127.0.0.1:43110/danknet.bit/?/dank/thread/271b81579add225009ac861a42a1f839",
				"added": 1465753598
			}
		],
		"1_1FoCQCBaoX3Fi85goewPLRLr1mxFqmCKNU": [
			{
				"comment_id": 3,
				"body": "Hey!",
				"added": 1465753769
			},
			{
				"comment_id": 4,
				"body": "> [2rkrowefrfkbnfjd](#comment_1_1LC2eZ8cXapoGWpmAX2xBAsXFk8mDjMJcC): Helloooo it's me!\n\nWho are you?",
				"added": 1465763360
			}
		],
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 5,
				"body": "You are dangerously wrong.\nThe only cause of this latest jihadist act are the teachings and the teachers of the cults of Islam.\nWe cannot afford to let the cults of Islam stay as they are. They must change.",
				"added": 1465844336
			},
			{
				"comment_id": 6,
				"body": "You are dangerously wrong.\nThe only cause of this latest jihadist act are the teachings and the teachers of the cults of Islam.\nWe cannot afford to let the cults of Islam stay as they are. They must change.",
				"added": 1465844393
			},
			{
				"comment_id": 7,
				"body": "Everyone, just watch [Islam Does Not Permit Homosexuality](https://youtube.com/?watch=cItgz3OpdTI).",
				"added": 1465892619
			},
			{
				"comment_id": 8,
				"body": "You all should also read [Islam and the Future of Tolerance](https://www.samharris.org/islam)\n\n    In this short book, Sam Harris and Maajid Nawaz invite you to join an urgently needed conversation: Is Islam a religion of peace or war? Is it amenable to reform? Why do so many Muslims seem drawn to extremism? What do words like Islamism, jihadism, and fundamentalism mean in today’s world?\n\n    Remarkable for the breadth and depth of its analysis, this dialogue between a famous atheist and a former radical is all the more startling for its decorum. Harris and Nawaz have produced something genuinely new: they engage one of the most polarizing issues of our time―fearlessly and fully―and actually make progress.\n\n    Islam and the Future of Tolerance has been published with the explicit goal of inspiring a wider public discussion by way of example. In a world riven by misunderstanding and violence, Harris and Nawaz demonstrate how two people with very different views can find common ground.",
				"added": 1465893167
			},
			{
				"comment_id": 9,
				"body": "http://127.0.0.1:43110/13XG2xb8jGHtb2DKW24ffpKvt7L5rswnwA/?Post:1:Islam+and+the+Future+of+Tolerance+by+Maajid+Nawaz,+Sam+Harris",
				"added": 1465894381
			},
			{
				"comment_id": 12,
				"body": "Most killing due to homophobia in this world is due to Islamism. Most countries that have anti-gay laws are Islamic. This is a hint to things to come.",
				"added": 1465902046
			},
			{
				"comment_id": 17,
				"body": "> [frerepoulet](#comment_1_17GqyGwVtGCVNaF5C3pQbBE7XP2WQWo8ge): No. 100% of killings due to homophobia are due to homophobia.\n\nAnd what is the cause of this homophobia? It is clear - the teachings of Mohammad.\n\n> You're an idiot.\n\nI am aware of my faults. There is no need to rub the salt in, you ableist bigot. But I am also right. Where do gay people lose their heads? Where are they being hanged? Where are they being stoned to death?\n\n> Making threats now?\n\nI am not an Islamist. There is no need to fear me.",
				"added": 1465923900
			},
			{
				"comment_id": 18,
				"body": "> [poubelle](#comment_2_1iKwsLs3AWyou1MY2jCTXn7Mc6L1VDiCL): How about the bible ? Mohammad influence there too ?\n\nHow many gay people were killed in the last 20 years by non-Muslim but still religious people? How many by Muslim for Muslim reasons?\n\n> Calling one's bullshit is ableism ?!?! This is the best SJW sophist crookery I've seen in ages.\n\nAren't you a SJW yourself?\n\n> You obviously can't see Russia from your house.\n\nRussian government is despicable, but it is only one country. The middle east is full of gay killing Islamic countries.\n\n> And you sure don't watch a lot of movies either. Just for you, then:\n> Jewish sionist homophobiaEnglish homophobiaFrench homophobiaWhite american homophobia #1White american homophobia #2White american homophobia #3White american homophobia #4White american homophobia #5White american homophobia #6Australian homophobiaFrench Canadian homophobia #1French Canadian homophobia #2Nazi homophobiaChinese homophobia\n> And these are just the ones I remember.\n\nMovies are not real life.\n\n> We don't fear you. But you are just as dangerous an enemy.\n\nI take guns and shoot people?",
				"added": 1465935620
			},
			{
				"comment_id": 20,
				"body": "> [poubelle](#comment_3_1iKwsLs3AWyou1MY2jCTXn7Mc6L1VDiCL): You don't answer my questions, you don't get me to do yours. Do you even know why xenophobia and genocide are two different words ? When you do, your question will answer itself.\n> If I adopted your moronic rethorics I could say something like muslim countries were peaceful and progressive until Jews took their land after WW2. So the cause of terrorism everywhere is Judaism.\n\n* Islamic countries directly follow the teachings of Mohammad as written in the Quran, in which the killing of homosexuals is commanded and commended.\n* Afghanistan was quite progressive, yeah, right before the Taliban (Islamists) fucked everyone in the ass.\n* Persia was getting there as well with all the anti-Shah movement, yeah, right before Kamenei (Islamist) fucked everyone in the ass.\n\n> Haha ! No. Quite the opposite. Surprised ? You clearly are not getting a single word that is being said here, do you ? Why don't you go push your shitty sionist agenda somewhere else?\n\nJoke's on you - I was just pretending to be a SJW. :-p\n\n> I have a feeling you will say that for anything that contradicts your narrow views.\n\n* You don't get to point at an outlier while covering the rest of the data points. This is not how we get a better understanding of reality.\n* Russia does not hang gay people.\n\n> Obviously what goes on in your mind isn't quite either.\n\nPlease calm yourself. We are both adults here.\n\n> I have seen you support gun violence on this very forum yes (I have taken all the related screenshots), but on top of that, here you do much much worse: you misappropriate a tragedy and completely warp it up your own xenophobic purposes away from the issue at stake: homophobia. Therefore, what you do is aggressively homophobic in itself.\n> There is no point talking to you. Shove this up your nickname.\n\nHomophobia in the west, outside the teachings of Islam, is a non-issue. By not recognizing that Islamism - political Islam -  is a serious problem, you are giving power to the right wing Christian fascists.",
				"added": 1465994063
			},
			{
				"comment_id": 21,
				"body": "> [spodermon](#comment_2_1Nyr4GJzcqNvk91aU3W7ayX3Tg7ZT4VZRQ): Homosexuality is very destructive.'Hitler was gay - and killed to hide it.'\"The respected German historian Lothar Machtan even claims in his book that Hitler ordered the deaths of several high-ranking Nazis to prevent the secret of his homosexuality from surfacing.\"\"According to a Munich police protocol from the early part of the 20th century, a 22-Many of the guards and administrators responsible for concentration camp horrors were themselves homosexuals and pedophiles. Famous Nazi hunter Elie Weisel was sent to Auschwitz, where he discovered that the head of his part of the camp \"loved children,\" and observed that \"there was a considerable traffic in young children among homosexuals there.\"year-old man called Joseph told the police: 'I spent the whole night with him.' Another, Michael, who was 18, told them: 'I had been unemployed for months, and my mother and my brother were always hungry, so, at his request, I accompanied the man to his home.' Another, a boy called Franz, said: 'He asked me if I'd like to stay with him and he told me his name was Adolf Hitler.\"https://www.theguardian.com/world/2001/oct/07/books.booksnews \n> \"Many of the guards and administrators responsible for concentration camp horrors were themselves homosexuals and pedophiles. Famous Nazi hunter Elie Weisel was sent to Auschwitz, where he discovered that the head of his part of the camp \"loved children,\" and observed that \"there was a considerable traffic in young children among homosexuals there.\"\"The \"Butch\" homosexual guards and capos were capable of unrestrained cruelty, sadism and savagery. A guard at Auschwitz, for instance, strangled, crushed and gnawed to death as many as 100 boys and young men a day while raping them at his leisure.\"\"Even today in America, it is chic in some homosexual circles for individuals to wear replicas of Nazi Germany uniforms, complete with iron crosses, storm trooper outfits, military boots and even swastikas.\"\"Some parts of the American Nazi movement are explicitly homosexual. The National Socialist League, in fact, at last word restricts its membership to homosexual Nazis.\"http://www.renewamerica.com/columns/fischer/100528\n\nSo Adolf Hitler was an homosexual atheist from Jewish descent?\n\nYou sound like the beginning of the following story:\n\nA liberal Muslim homosexual ACLU lawyer professor and abortion doctor was teaching a class on Karl Marx, a known atheist.\n\n\"Before the class begins, you must get on your knees and worship Marx and accept that he was the most highly-evolved being the world has ever known, even greater than Jesus Christ!\"\n\nAt this moment, a brave, patriotic, pro-life Navy SEAL champion who had served 1500 tours of duty and understood the necessity of war and fully supported all military decision made by the United States stood up and held up a rock.\n\n\"How old is this rock?\"\n\nThe arrogant professor smirked quite Jewishly and smugly replied \"4.6 billion years, you stupid Christian\"\n\n\"Wrong. It’s been 5,000 years since God created it. If it was 4.6 billion years old and evolution, as you say, is real… then it should be an animal now\"\n\nThe professor was visibly shaken, and dropped his chalk and copy of Origin of the Species. He stormed out of the room crying those liberal crocodile tears. The same tears liberals cry for the \"poor\" (who today live in such luxury that most own refrigerators) when they jealously try to claw justly earned wealth from the deserving job creators. There is no doubt that at this point our professor, DeShawn Washington, wished he had pulled himself up by his bootstraps and become more than a sophist liberal professor. He wished so much that he had a gun to shoot himself from embarrassment, but he himself had petitioned against them!\n\nThe students applauded and all registered Republican that day and accepted Jesus as their lord and savior. An eagle named \"Small Government\" flew into the room and perched atop the American Flag and shed a tear on the chalk. The pledge of allegiance was read several times, and God himself showed up and enacted a flat tax rate across the country.\n\nThe professor lost his tenure and was fired the next day. He died of the gay plague AIDS and was tossed into the lake of fire for all eternity.\n\nSemper Fi \n",
				"added": 1466095822
			}
		],
		"1_139X4c3WFVtmsEj6Vpdd74YY49ettpduKq": [
			{
				"comment_id": 10,
				"body": "[List of Search Engines](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zite-list-searches) from [ZeroWiki's](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/) [List of Zites](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:list-of-zites)",
				"added": 1465894913
			}
		],
		"5_178NSuZP2hH2vHhNX6vsHceh5sjPkDrLiH": [
			{
				"comment_id": 11,
				"body": "Anything that lowers the barrier to Free Software adoption is a good thing.",
				"added": 1465896084
			},
			{
				"comment_id": 13,
				"body": "> [chinabiz](#comment_8_1DWrKbEomgBLHjczm1HkP556Vg68ewDmyd): Microsoft once referred to Linux as a cancer.... Steve Bullmer: \"Linux is a cancer that attaches itself in an intellectual property sense to everything it touches\", that's not including the part where he said that Linux users were a bunch of communist thieves, I rest my case...\n\nThey accept their cancerous fate. We, acolytes of Saint Ignucious, had won this campaign in our war for Free Culture.",
				"added": 1465902291
			}
		],
		"1_18AAv2MxpUxLjG6U64nucoBg833eTaR83u": [
			{
				"comment_id": 14,
				"body": "Thanks @spodermon!",
				"added": 1465908427
			},
			{
				"comment_id": 15,
				"body": "> [chinabiz](#comment_9_1DWrKbEomgBLHjczm1HkP556Vg68ewDmyd): Sent, no idea if you have received it or not.\n\nThank you, @chinabiz! Got you loud and clear!",
				"added": 1465910398
			}
		],
		"1_175A4pxQi9MxM3im5oWZGqZPTyVWXQA6Bw": [
			{
				"comment_id": 16,
				"body": "Skill? Talent?",
				"added": 1465921128
			}
		],
		"2_18AAv2MxpUxLjG6U64nucoBg833eTaR83u": [
			{
				"comment_id": 19,
				"body": "> [nofish](#comment_687_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): There is no particular reason, i'm open to change the license/other ideas, here is a github issue about it: https://github.com/HelloZeroNet/ZeroNet/issues/224\n\nAGPLv3+ (with the \"or higher\" text) would be great!",
				"added": 1465943114
			}
		]
	},
	"comment_vote": {
		"3_15Q5Exq2vXfkxiKQvjHWgqaFKuSEsGyJpF": 1,
		"1_1CVcfATCiV5C6fy16bdppggrK5K664xK3b": 1,
		"58_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1,
		"1_18GHRRFQYHNstG54GhC8cEgiPptdNkBr3c": 1,
		"1_19CWYnBoRrH66VR83KfoEDCndvpiXCDMh5": 1,
		"1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": 1,
		"20_1CL2jU9pTjtMasNihDK3JCofdPWq2ZVGuu": 1,
		"8_1Kg7CXZM5h3wTPENsTDwWUmRBf9VhYy2cW": 1,
		"1_1LC2eZ8cXapoGWpmAX2xBAsXFk8mDjMJcC": 1,
		"3_178NSuZP2hH2vHhNX6vsHceh5sjPkDrLiH": 1,
		"2_18xnnGt34EMR7CLFoAjwzhYCmXGtZYC17P": 1,
		"9_1DWrKbEomgBLHjczm1HkP556Vg68ewDmyd": 1,
		"4_18xnnGt34EMR7CLFoAjwzhYCmXGtZYC17P": 1,
		"166_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": 1,
		"687_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"30_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": 1,
		"29_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": 1,
		"113_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r": 1,
		"171_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP": 1,
		"112_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r": 1
	}
}