{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "HOW MUCH DO WOMEN COST IN YOUR COUNTRY",
			"body": "IN MY NATIVE COUNTRY OF INDIA WOMEN ARE VERY COST HOW MUCH DO WOMAN COST YOUR COUNTRY\n- APU",
			"added": 1472695861
		},
		{
			"topic_id": 2,
			"title": "Why are you voting for Jill Stein?",
			"body": "Everybody I know is voting for Jill Stein. Why do you love Jill Stein? Is it her stance on the wars in Iraq and Afghanistan, or is it her life-long determination to end healthcare discrimination? Or one of her other powerful stances?",
			"added": 1472883027
		}
	],
	"topic_vote": {
		"1_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV": 1,
		"1_1Eb3jLeJMFfN5z7oUhNbiLqYn24fTofzEJ": 1,
		"5_1C6qdRAX8iYqSB7TfUxk91yW8Y2SBKNgfA": 1
	},
	"next_comment_id": 35,
	"comment": {
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 1,
				"body": "The real question: Will women ever use this network?\nAnd what's so bad about gun dealers, anyway? You want a gun, don't you?",
				"added": 1472620710
			},
			{
				"comment_id": 2,
				"body": "> [chloe](#comment_11_1LJLVfT9hKRuTHzBKTpse57PGfpwx82myR): Is there any way to stop criminals from using the internet? I recently saw a post on Reddit asking about rape stories.\n\n(((Anthony Weiner))) was a user of the Internet for YEARS - YEARS!\nbut srsly, a female nick wtf you a faggot?",
				"added": 1472620993
			},
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_186_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): There's already several on here. We've probably been using ZeroNet longer than you have, TBH.\n\nBORN female. Like XX female, not XY + mentally ill.",
				"added": 1472695994
			},
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_187_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \n> If you don't like it here, gtfo.\nYour hugbox is on clearnet. You will be a safe artificial female there.",
				"added": 1472785554
			},
			{
				"comment_id": 8,
				"body": "> [edantes](#comment_29_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi): \n> If I am unable to delete that kind of stuff (or any other objectionable material) then my site and its reputation are at the mercy of whomever decides to post, which is crazy. How is spam supposed to be dealt with? This needs to be addressed ASAP.\nNo it doesn't. Just don't allow images to be hosted, fucktard\nTake here as an example. No worries here, no need to delete anything either.",
				"added": 1472785701
			},
			{
				"comment_id": 9,
				"body": "> [teszt](#comment_35_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): This is a very delicate question. Hard to find the right balance between a moderation able forum and a censorship-resistant one.\nIt's not possible. There is freedom and non-freedom. You either control other people or you don't. Now, you can do what is right, yourself. How is that not good enough? Isn't it enough to boss yourself around? Why must you go about like some cosmic busy-body?",
				"added": 1472785812
			},
			{
				"comment_id": 16,
				"body": "> [teszt](#comment_37_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): \n>between the extremes \nJust have a script that hides whatever you want hidden. It's not really deleted, but it's hidden.",
				"added": 1472855171
			},
			{
				"comment_id": 27,
				"body": "> [kaffie](#comment_190_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh):\nnobody cares about your genitals. You can totally be female here, misseh",
				"added": 1473042933
			}
		],
		"6_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR": [
			{
				"comment_id": 3,
				"body": "More non-Tor users.",
				"added": 1472621613
			},
			{
				"comment_id": 6,
				"body": "> [jarmund](#comment_4_1CiHRyU3rHFGR1rEyTPDYH7xjN99iPZkBJ): Why? I'm not a Tor users but I don't know why is it a problem to have many Tor users on Zeronet?\n\nTor is slow, and requires the resources of volunteers. When connecting directly to Zeronet you are contributing the most possible, personally. It is also more efficient.",
				"added": 1472696225
			}
		],
		"1_18ZbdG9rMgLWzfFrWMkyGXtSv7MyPfUuSj": [
			{
				"comment_id": 4,
				"body": "download torrents from inside of the whonix workstation VM.",
				"added": 1472621802
			}
		],
		"1_1JecQYorYpL9F9vArLj13LKvc3v3iSdDHA": [
			{
				"comment_id": 10,
				"body": "Zeronet is mostly about preventing censorship. Zeronet is NOT anonymity-oriented - yet. This of this as a public forum. Just like clearnet, except without any central point of failure. Your own personal \"get unfiltered info\" system (but the spooks will be here, guaranteed).",
				"added": 1472786297
			}
		],
		"18_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 11,
				"body": "SEED!",
				"added": 1472791269
			},
			{
				"comment_id": 12,
				"body": "> [sirenyc](#comment_82_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Just 1 seed to me. there does not appear?\n\nIt says \"0 peers\"",
				"added": 1472800117
			}
		],
		"4_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": [
			{
				"comment_id": 13,
				"body": "The car industry is down about 40% from last year, in month comparisons, over the past couple of months. Bush's fault.",
				"added": 1472800743
			}
		],
		"1_114c9kLxp6SPG4xhhHZEnoijFdYA8j23JE": [
			{
				"comment_id": 14,
				"body": "> [beoxoeb](#comment_15_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa): upload them here, is the Zeronet KAT version :) http://127.0.0.1:43110/1LBr1dHoXvJAMjDgW8Wcg5kbCoKyJnzo6p/\n\nFuck off, man, that's fake crap.",
				"added": 1472800932
			}
		],
		"1_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV": [
			{
				"comment_id": 15,
				"body": "You should add the soros dcleaks. They were taken down, as was their Twitter account.",
				"added": 1472801269
			}
		],
		"16_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 17,
				"body": "Yep, they all say zero peers.",
				"added": 1472867234
			}
		],
		"1_1ELBjparWRzWWptstDfNtKyY2E5mHtL5J4": [
			{
				"comment_id": 18,
				"body": "Was it the plan?",
				"added": 1472985637
			},
			{
				"comment_id": 19,
				"body": "> [lorem](#comment_3_1HXv2c6awyWdtUb8SeP7bWViMHcvxdV82X): Have we started the fire?\n\nNo sir. It was always burning since the world was turnin'.",
				"added": 1472986236
			},
			{
				"comment_id": 26,
				"body": "Ask me about my girth.",
				"added": 1473042792
			}
		],
		"1_16RxPB8u2PPvMvASMreEvH3q7S5xm2LzjP": [
			{
				"comment_id": 20,
				"body": "Drag the \"0\" in the top right of this page to the left until you can see the globe. It may take a while to load. You will notice there is very little in Africa. they are probably just white people who have jobs there or something.\n\nAnother thing you can do is wear blackface and rob gas stations. That will make people who are white have a better reputation.",
				"added": 1472992932
			},
			{
				"comment_id": 21,
				"body": "> [kuuuurija](#comment_6_1JecQYorYpL9F9vArLj13LKvc3v3iSdDHA): dumbass!\nðŸ†",
				"added": 1472994476
			},
			{
				"comment_id": 22,
				"body": "> [supernigger](#comment_4_16RxPB8u2PPvMvASMreEvH3q7S5xm2LzjP): Yeah but what about chinks and hindoo poo in loos and mexicans? How do we make sure this new technology is out of their reach?\nTeach them Christianity, so they ban birth control bwahahahaha",
				"added": 1472994526
			},
			{
				"comment_id": 23,
				"body": "> [kopykate](#comment_5_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): First troll on ZeroNet? ^^\n\nWell, the first troll was the one that added the \"tor\" button.",
				"added": 1473042537
			},
			{
				"comment_id": 24,
				"body": "> [heaven](#comment_1_18R2FPhZjCrKtLRt6NAtMMWYTV8Zwxw43): But then some of them might go to heaven, then heaven would be ruined.\n\nSkip heaven, go to Valhalla, where the real men are.",
				"added": 1473042594
			}
		],
		"2_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": [
			{
				"comment_id": 25,
				"body": "> [brightleaf](#comment_2_1EcyKJb7LSwtqvx2JT7Bs572RPwxbQHbYV): If you were going to vote third party, why would you ever pick Jill Stein over Johnson?\n\nJill Stein is 99% non-fag.",
				"added": 1473042724
			},
			{
				"comment_id": 29,
				"body": "> [rkit67](#comment_2_151hRHzUZDH9dGn7cuwh1H4mPNDo7GQr3r): If you're going to vote 3rd party over civil rights you might want to vote for a party other than the green party. The green party wants open borders you can't have a sovereign state with open borders. Fuck Jill Stein right in her pussy!!\n\nWow you are very intolerant!!!",
				"added": 1473239368
			},
			{
				"comment_id": 33,
				"body": "> [sthetz](#comment_17_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Everyone I know is voting for Trump. There is literally zero chance of any third-party candidate winning. It's either Trump or Hillary, and wicked bitch Hillary may go fuck herself. Trump 2016.\n\nOh wow is your family a bunch of KKK guys with hoods and everything, burning crosses on the 4th?",
				"added": 1473410610
			},
			{
				"comment_id": 34,
				"body": "> [jeff](#comment_2_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Q: How is the Green party like a watermelon?A: Though they're green on the outside, they're red on the inside.\n\nEveryone knows watermelons are golden on the inside, unless you're eating shit-tier watermelon.",
				"added": 1473411521
			}
		],
		"5_1C6qdRAX8iYqSB7TfUxk91yW8Y2SBKNgfA": [
			{
				"comment_id": 28,
				"body": "Cool site! Zeronet isn't for anonymity. Zeronet is for maintaining connections even if DNS is lost. In addition, it could prove the most useful blogging platform, since each user becomes a server, making any slightly popular site impossible to take down.\n\nPrivacy apps will have to be built atop Zeronet, and it can be done. \n\nI just looked at the script. It's very simple. It calls http://l2.io/ip.js?var=myip, which is just an external site that responds with your IP address. So all it's doing is accessing an external site.\n\nBut fixing that problem isn't enough, because malicious javascript could cause deanonymization anyway. It's a somewhat routine event. Every few years there's a zero day discovered where javascript deanonymizes users. So I guess you could turn off scripts and try to get your browser to not load content that's not through the zeronet local proxy. But I wouldn't trust the browser to do either reliably.",
				"added": 1473239095
			}
		],
		"1_1Psd8z6hvC62pEbVgtTAXbuM3PFPgz46tZ": [
			{
				"comment_id": 30,
				"body": "> [tkarita](#comment_144_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): The closest is Play.  YIFY doesn't really exist anymore: https://torrentfreak.com/yts-ag-wants-to-be-the-new-yify-on-popular-torrent-sites-151113/\n\nSpitify is pretty spoffy. but spies.",
				"added": 1473410450
			}
		],
		"3_1K4ZbzAxkpr7BJyVqFdZiXptiiNSQCvDBW": [
			{
				"comment_id": 31,
				"body": "> [citizen1](#comment_3_1BbmERojUUFZUFTQjz7S9yfDBGsV6jfEx6): Spam has found it's way to ZeroNet.\n\nBaptism in spam is what they're calling it. After this the old will be gone, and we will have a new life!",
				"added": 1473410521
			}
		],
		"1_14bL4owkcQDHhEBKncp1QEXH3Su764ENdQ": [
			{
				"comment_id": 32,
				"body": "Good to see you supporting the local economy!",
				"added": 1473410568
			}
		]
	},
	"comment_vote": {
		"14_1P7F9po18mshkbRG5zEVV47vHtLEX19QJa": 1,
		"1_15k25aCTwyHfXnqtqpRvBbkDz5ka7gFuuU": 1,
		"126_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": 1,
		"2_13CnFMgi6N7KQkuomswsVwSU7bKfRC82KY": 1,
		"176_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP": 1,
		"11_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"3_1HXv2c6awyWdtUb8SeP7bWViMHcvxdV82X": 1,
		"177_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP": 1,
		"3_1BbmERojUUFZUFTQjz7S9yfDBGsV6jfEx6": 1
	}
}