{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Any Gundam fans?",
			"body": "",
			"added": 1456908707
		}
	],
	"topic_vote": {
		"1_17z5FGPZEN2L6xMFDT5n4YTKvPivJfiuSG": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1ATG1fuopoWWvSbwU99cWx2RQxLexG5ENq": [
			{
				"comment_id": 1,
				"body": "This seems shady...",
				"added": 1456905476
			}
		],
		"1_17z5FGPZEN2L6xMFDT5n4YTKvPivJfiuSG": [
			{
				"comment_id": 2,
				"body": "> [khast](#comment_1_1A6oUZyZJqFH9u7wAebPHrhyKKLEoiBVSj): I like putting the models together, does that count? I mean who doesn't like cool looking completely articulated robot action figures?\n\nThat does count, big gunpla fan here. Build any cool kits lately?",
				"added": 1456908939
			},
			{
				"comment_id": 3,
				"body": "> [khast](#comment_2_1A6oUZyZJqFH9u7wAebPHrhyKKLEoiBVSj): I haven't, I have about 3 or 4 kits that I've gotten a couple months ago.  Need to get time to sit down and work on them though.  I tend to take my time, so they look good when they are done.\n> (Although, I actually know nothing about the anime, unfortunately.)\n\nI'm just getting back into the anime myself (I'm not a big anime fan, watched some of Wing over a decade ago, built a few kits at the time). It's pretty good once you get into it.",
				"added": 1456909167
			},
			{
				"comment_id": 6,
				"body": "No other Gundam fans?",
				"added": 1456970763
			}
		],
		"1_15zfQw1PPLNRYGUtuzTj1LN5hX6K24rUnY": [
			{
				"comment_id": 4,
				"body": "> [cannonfodder](#comment_2_1GCMDNMgJHvZJfdbD9ygDmpBdnVAobdJYg): Post a namecoin address and I'll send you enough coins to get a name. Same for anyone else who wants one. If you want you can zeromail me at cannonfodder and I'll register the name set to the site address you want. When/if you get namecoin installed I'll then transfer you the name.\n\nI'll take you up on your kind offer, just sent you a mail there :)",
				"added": 1456912236
			}
		],
		"1_16Hg8ux8t4gqZjGgiEUWQ8xAsqJrtJv7MC": [
			{
				"comment_id": 5,
				"body": "Of ZeroNet? I am.",
				"added": 1456913232
			}
		],
		"1_1CNWTRN6cn761Wyb4eauhUU8wiKgGSTMC7": [
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_23_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I have listed a search engine, along with various other beginner tools over on my blog: http://127.0.0.1:43110/kaffie.bit/?Post:2\n> ZeroSearch is probably what you're looking for.\n\nYour link didn't work, here's the correct one:\n\nhttp://127.0.0.1:43110/kaffie.bit/?Post:2:ZeroNet+Beginner%E2%80%99s+Package",
				"added": 1456986514
			}
		]
	},
	"comment_vote": {
		"1_1A6oUZyZJqFH9u7wAebPHrhyKKLEoiBVSj": 1,
		"2_1A6oUZyZJqFH9u7wAebPHrhyKKLEoiBVSj": 1
	}
}