{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1JXFzMzrQTJCiGw36YNQGg2Tmt1hTHy7ZT": 1,
		"8_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	},
	"next_comment_id": 9,
	"comment": {
		"3_12a5bEEVXyvu1jer6JpujSPra1A21wKcQT": [
			{
				"comment_id": 1,
				"body": "Keep it up, the last thing you want to do is use anything to cope. I don't want to pretend to know more than I do. So I really don't know the best way to approach someone with a substance abuse problem. I would seek professional consultation, tell them your situation. Let them tell you what is the best course of action. I wouldn't confront them head on though. I remember hearing that just leads to defensiveness and further conflict.",
				"added": 1469157746
			}
		],
		"14_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 2,
				"body": "I was looking into I2P when I learned about this though some obscure article. The dead cat in the room sure brought me back though. So I might stick around for good this time.",
				"added": 1469158140
			}
		],
		"1_1JXFzMzrQTJCiGw36YNQGg2Tmt1hTHy7ZT": [
			{
				"comment_id": 3,
				"body": "Contribute, only way shit gets done on here.",
				"added": 1470232705
			}
		],
		"1_1CJoRKtTrkCDDExSc2YDyJew3SNm943rK": [
			{
				"comment_id": 4,
				"body": "Even if it's just something like Kingdom of Loathing or a MUD,\n I would still play the shit out of it. Heck, you could probably have direct player effects on the world, structures, stuff like that.",
				"added": 1470233056
			}
		],
		"8_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 5,
				"body": "You remember that kid in primary school? Yeah, that smug asshole with curly hair. Guess what? His favorite color was blue. You wanna be like that kid?",
				"added": 1470911621
			}
		],
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 6,
				"body": "The sheer amount this platform is capable of both amazes and terrifies me. Next thing you know we will have sliced bread and horseless carriages.",
				"added": 1470912197
			}
		],
		"1_1Hrxe8am5by9G5k4MeQDHVLepsJJ9yX5Fg": [
			{
				"comment_id": 7,
				"body": "It looks cool if you are into that sort of thing. When I learned it wouldn't be multiplayer I couldn't see it being worth the 60 Bigmac Bucks or GoG or otherwise.",
				"added": 1470912397
			}
		],
		"1_1DjUq8hd2jYZgc5uNhQEtWUVZjMHkMQkpU": [
			{
				"comment_id": 8,
				"body": "That's it. We officially need a ZeroNet torrent zite search engine. With the release of kickasstorrents I can no longer get my grand theft movie done all in one zite. What are we? Savages?",
				"added": 1470912626
			}
		]
	},
	"comment_vote": {
		"3_13o2BgF1FL4bwNSGMVySUjQmKMMkj9vFTK": 1,
		"38_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"1_12tst7BxExjRDyzhZQm4xkrLU9C29JL472": 1,
		"9_1D6Pn4487L8QyFtVSU14nxxtnfEgEs2Ny1": 1,
		"2_13WWWFi6iuSLazDcNvHgBEjjeAofAhAwtE": 1,
		"6_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi": 1
	}
}