{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2": 1,
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": [
			{
				"comment_id": 1,
				"body": "> [hitleryesyesyes](#comment_2_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2): We must excise the jewish cancer before it is too late.\n\nSo do not vote for the dirty jew Bernie Sanders or Ed Miliband !",
				"added": 1458542830
			},
			{
				"comment_id": 4,
				"body": "> [faggot](#comment_2_1GEvK9iUAmRQyt8xhVXB8UGEugpis7XE8z): stfu, you dirty jew\n\n> [faggot](#comment_2_1GEvK9iUAmRQyt8xhVXB8UGEugpis7XE8z): stfu, you dirty jew\n\nlet's smoke the jews out of zeronet!",
				"added": 1458546414
			}
		],
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 2,
				"body": "> [pycole](#comment_87_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Right. And since the barrier to entry for making your own site is pretty low (basic html/css/javascript knowledge, or just knowing how to press the 'clone' button), it can hardly be called censorship. It's not being banned from a platform: a set of people are just refusing to be your audience.\n> ...Which we're doing a decent job of right now, I'd say.\n\nfuck you faggots.\n\nHeil Hitler !",
				"added": 1458546288
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_96_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): To add to this, there's a difference between presenting an opposing view (hitler was right, for instance) and talking about it in a decent humane way, and simply spamming shit and hating on people with no real room for discussion on a public forum.\n> \n> Last I checked, it's impossible to censor ZeroNet sites. That doesn't stop people from wishing to keep a civil atmosphere in particularly public sites. Again, refer to my previous comment. We have wonderful search engines, decentralized hosting, etc. so that you may share content that you please without clogging up public forums with hate.\n\nwell, Heil Hitler. The Fuhrer did nothing wrong!",
				"added": 1458546344
			}
		]
	},
	"comment_vote": {
		"2_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2": 1,
		"6_1GEvK9iUAmRQyt8xhVXB8UGEugpis7XE8z": 1,
		"1_1B7ef4NZMcDZm74M6CjkoztZAGKeCdaQfS": 1,
		"2_1GEvK9iUAmRQyt8xhVXB8UGEugpis7XE8z": 1
	}
}