{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Silk Road 5.0",
			"body": "(For sale weed/grass) - green, freshest, first cutting, buds included...30lb bags\nGreat for high-\n-grade mulch\nstraight off my lawn, act now and I'll throw in leaves, twigs and giggle berries...you pick up.",
			"added": 1458673407
		}
	],
	"topic_vote": {
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1FQzw6BBWb8DqSgT3uMsMpcWu3uz48bEDX": [
			{
				"comment_id": 1,
				"body": "The gig is up, they're beating down the door, head out the windows!!!",
				"added": 1458661629
			}
		],
		"1_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2": [
			{
				"comment_id": 2,
				"body": "None of you have been in war and have experienced what it does to people. You have no clue or even an inkling of an idea of what you are talking about. You probably haven't even left your home country, let alone been to Germany. Focus on posting what you know; video games, youtube and porn.\nEven a fool is thought wise if he keeps silent, and discerning if he holds his tongue.",
				"added": 1458662730
			}
		],
		"4684_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 3,
				"body": "While a fundamentally agree that this type of online behavior is bad for the real world and must be stopped. I find it shocking that the FBI did not take the site down, but instead used tax dollars to HOST child porn. If it's illegal for John Q public to host a child porn website, what makes it legal for the government?  I'm sorry, but the ends don't justify the means.\nnon facias malum ut inde fiat bonum",
				"added": 1458663820
			},
			{
				"comment_id": 4,
				"body": "Entrapment is where they don't give a person an \"out\", the ability to choose the right path. They are given no choice but to pick a bad option.  Sting operations allow the citizen the option to do bad or not do bad.",
				"added": 1458664188
			}
		],
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": [
			{
				"comment_id": 5,
				"body": "> [hitleryesyesyes](#comment_1_1LP5G2PJAXqmcvKeVF8Z3v73G6ezmwFUQ2): Sanders is a dirty jew. The Donald will send him off to Auschwitz, where the motherfucker belongs. Send all jew scum to Poland!\n\nWhy would he send them to Auschwitz?  You said nothing happened there, so why do you want to send anyone there?  You don't know what you want, do you?  You're just lashing out because your life is so fucked up and your jealous of anyone that has their shit together that you want to bring them down to your pathetic level.\nYou know nothing of war, so go back to watching internet porn and cartoons.",
				"added": 1458676881
			}
		],
		"1_15kuNrNeQtVRmDqENgbCqw6s3mG9noQ7zA": [
			{
				"comment_id": 6,
				"body": "> [antifa](#comment_16_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h): they fucking better. suck my diiiiiiiiick, state!\n\nreally? you would like the a politician (most likely a crusty old man) to do that to you? You've got serious mental issues that indeed belong in a state sponsored living arrangement. Maybe then you can get a state employee do the dirty, but you'll be long gone from zero and we'll be a lot better off.....here's to the future, sans antifa.",
				"added": 1458677212
			}
		]
	},
	"comment_vote": {
		"76_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": 1,
		"1_1AxJtqoxhNyjRjUptGgVoVHxgxtKRzUrpY": 1
	}
}