{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1,
			"title": "Saluton! Ĉu ajn Esperantistoj ĉi tie?",
			"body": "",
			"added": 1456894869
		},
		{
			"topic_id": 2,
			"title": "howmanypeopleareinspacerightnow",
			"body": "http://www.howmanypeopleareinspacerightnow.com/",
			"added": 1456906400
		},
		{
			"topic_id": 4,
			"title": "Is it just me who feels uneasy about banks and other financial institutions putting themselves on Blockchain?",
			"body": "It feels a little dystopic, everything we buy will be potentially stored in history!",
			"added": 1456969911
		},
		{
			"topic_id": 5,
			"title": "How is Ethereum different to ZeroNet?",
			"body": "",
			"added": 1457003075
		},
		{
			"topic_id": 8,
			"title": "Rodong Sinmun Dismisses \"North's Military Provocation\" Touted by S. Korean Puppet Forces",
			"body": "Pyongyang, March 1 (KCNA) -- The south Korean puppet forces' floating of the fiction about \"north's military provocation\" is nothing but a deceptive artifice to cover up their true colors as provocateurs, says Rodong Sinmun Tuesday in an article.\n     It is their long harbored ambition to provoke a war against the north, the article notes, and goes on:\n     The \"north Korea policy\" of the south Korean conservative authorities is, in essence, a war policy to realize their ambition for invading the north in collusion with outsiders.\n     It is well known that traitor Park Geun Hye appointed military confrontation maniacs to important posts as soon as she became boss of Chongwadae and incited military confrontation with the north, pursuant to the U.S. hostile policy toward it.\n     No sooner had Park taken office than staged Key Resolve and Foal Eagle joint military exercises against the north together with the U.S. imperialist aggression forces.\n     The puppet forces fully revealed their war hysteria through subsequent large-scale joint military drills such as Ulji Freedom Guardian.\n     This clearly proves the criminal nature of the group of traitors who are only keen to provoke a war against the north in utter disregard of the destiny of the inter-Korean relations.\n     It is no more than a daydream for them to realize their ambition for invading the north while pursuing a sinister aim through the floating of sheer fiction about \"military provocation\" from the north.\n     The Park Geun Hye group will face only a disgraceful destruction if it persists in reckless military provocations, failing to come to its senses despite the warnings of the DPRK.",
			"added": 1457057725
		},
		{
			"topic_id": 9,
			"title": "How do I invalidate my private key if someone has it?",
			"body": "",
			"added": 1457059407
		},
		{
			"topic_id": 10,
			"title": "0chan is not anonymous despite offering the setting.",
			"body": "In the zeronet folder it contains all the sites you have cached, in there is 0chan if you've visited it and other other chans you might have visited. All of the posts are stored inside the 0chan folder in /data/users and are grouped by user who posted them. Open the content.json files and you find the person's username responsible for the posts.\n\nTl;dr 0chan and derivs claim to give option of posting anonymously but finding the original poster and commenters is trivial.",
			"added": 1457065385
		},
		{
			"topic_id": 11,
			"title": "Kim Jong Un Guides Test-fire of New Multiple Launch Rocket System - attacks \"gangster-like\" sanctions",
			"body": "Pyongyang, March 4 (KCNA) -- The U.S. imperialists and their followers' flagrant moves for political and economic pressure and military aggression on the DPRK have gone to a grave phase that can no longer be overlooked. They committed a ferocious hostility of illegalizing the DPRK's independent rights as a sovereign state by adopting an unprecedented and gangster-like, new \"resolution of sanctions\" over its bolstering of self-defensive nuclear deterrent and legitimate launch of earth observation satellite Kwangmyongsong-4.\n\nAll the people in the DPRK are now waiting for an order of combat to annihilate the enemy with their surging wrath at the U.S. imperialists and south Korea's Park Geun Hye group of traitors.\n\nUnder such situation, there took place a test-fire for estimating the might of controlled ordnance rocket warhead for large-caliber multiple launch rocket system of new type to be deployed in the reserve artillery units of the Korean People's Army.\n\nKim Jong Un, first secretary of the Workers' Party of Korea, first chairman of the National Defence Commission of the DPRK and supreme commander of the Korean People's Army, guided the test-fire on the spot.\n\nAt an observation post he learnt in detail about the planned test-fire of new-type large-caliber multiple launch rocket system and the tactical and technological specifications of controlled ordnance rocket and gave an order on starting the test-fire.\n\nThe test-fire in various ways with mine rockets, under-ground penetrating rockets and canister rockets showed that the ordnance rocket warhead, made in combination with high-energy material, has amazing destructivity and killing power.\n\nKim Jong Un was very satisfied to see controlled ordnance rocket hitting accurately and destroying to pieces the strongly-built simulated enemy personnel, tank, artillery and vehicle shelters.\n\nHe said the development of Juche weapon representing the era of the dignified Workers' Party is a proud result from the undying feats of President Kim Il Sung and leader Kim Jong Il, who had dedicated their mental and physical efforts to the strengthening of the Juche-based defence capability, and from the Party's policy of attaching importance to the defence science and technology. At the same time, it eloquently shows the tremendous potentials of the DPRK's self-supporting defence industry, he added.\n\nThe serial production of Korean-style large-caliber multiple launch rocket system of new type helps further strengthen the striking power of the Korean People's Army qualitatively, he said with satisfaction.\n\nThe situation has reached a very dangerous phase that can no longer be neglected as the enemies are intent on such last-ditch attempt as \"beheading operation\" and \"collapse of social system\" while working hard to violate the dignity and sovereignty of the DPRK and its right to existence, he said, adding: Now is the time for us to convert our mode of military counteraction toward the enemies into a preemptive attack one in every aspect.\n\nIt is a very foolish act for Park Geun Hye to cry out for \"preemptive attack\" while recklessly beefing up the armed forces in league with the U.S. scoundrels, but her hysteria will precipitate only her ruin in the long run, he noted.\n\nHe said that the DPRK would see what sophism the enemies, seeking to deprive it of the independent right to use space for peaceful purposes, would spout to mislead public opinion over the test-fire of its new weapons system held today, with their large-scale joint military exercises against it ahead.\n\nHe stressed that the national defence sector should deploy at an early date new-type large-caliber multiple launch rocket system and other recently- developed strike weapons in the operation areas of the Supreme Command so as not to allow the enemies to sleep in peace till the moment they meet their final end in their land.\n\nThe only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force both in quality and quantity and keep balance of forces, he said, stressing the need to get the nuclear warheads deployed for national defence always on standby so as to be fired any moment.\n\nHe expressed belief that the officials, scientists and technicians engaged in the defence science would steadily develop new-type ultra-modern strike arms and equipment, make fresh leaping progress in the strengthening of military capability this year greeting the Seventh Congress of the WPK and thus consolidate the country's defence capability as firm as a rock.\n\nHe was accompanied by Choe Ryong Hae, secretary of the C.C., WPK, Hong Yong Chil and Kim Jong Sik, vice department directors of the C.C., WPK, and Army Colonel General Yun Tong Hyon, vice-minister of the People's Armed Forces.",
			"added": 1457204125
		},
		{
			"topic_id": 12,
			"title": "Have you ever heard of Alexander Dugin and the fourth political theory?",
			"body": "",
			"added": 1458062530
		}
	],
	"topic_vote": {
		"1_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": 1,
		"3_1NRTwjkXBxbeyrWhUvik7pLVoxWtsSjHQi": 1,
		"1_1E1PGsCSCNzkP8xmx8awJ2hho3cPdsN4FF": 1,
		"4344_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1
	},
	"next_comment_id": 43,
	"comment": {
		"2_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 1,
				"body": "There are usually 6, 3 literally just came back. On the rare occasion, there are 9 up there and in the past there were even 13.",
				"added": 1456906937
			},
			{
				"comment_id": 2,
				"body": "Just ISS right now. Probably won't change until Russia's OPSEK space station and China's Tiangong missions launch properly in 2020's. Actually Tiangong-2 is going up soon and there might be a manned mission to it so the count could go up to about 8 for a bit.",
				"added": 1456907844
			}
		],
		"1_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 3,
				"body": "> [aa0](#comment_1_135brhPGmL8zaPAJBFgR69pW7WWxWkNsQu): Eble... :)\n\nMojosa, kiam vi komencis lerni ĝin?",
				"added": 1456910034
			},
			{
				"comment_id": 6,
				"body": "> [aa0](#comment_2_135brhPGmL8zaPAJBFgR69pW7WWxWkNsQu): Antaŭ nelonge; mi estas ankoraŭ novulo. Kaj vi?\n\nĉirkaŭ unu jaro",
				"added": 1456940689
			}
		],
		"1_16Hg8ux8t4gqZjGgiEUWQ8xAsqJrtJv7MC": [
			{
				"comment_id": 4,
				"body": "rev914 it says in the drop down on home page",
				"added": 1456913272
			},
			{
				"comment_id": 5,
				"body": "just updated to 915",
				"added": 1456913590
			}
		],
		"4_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 7,
				"body": "> [gates](#comment_1_13hX8SoLGfqRfkJYubPNpyKsuHBRYiggRz): everything you buy is currently logged, tracked, and stored on various servers i.e gov, credit card, bank/debit cards, etc. These logs are also shared with the marketing industry.\n\nAll that is logged with me is what bank branch I used to take out cash. When I go shopping I use cash typically unless done online. We're looking at this vanishing and that's pretty scary.",
				"added": 1456972129
			},
			{
				"comment_id": 8,
				"body": "> [lkssal](#comment_1_1LbFpYVwrHwCrr67PSHKoZahGD8gEWGULn): If you want to complain about something with somebody, the something must be stored (history)somewhere.Now with Blockchain, nor you nor the somebody can modify what you have done together\n\nSure it has its uses, I'm not sure that my shopping is a thing I want storing though (presuming I use cash nowadays.)",
				"added": 1456972190
			}
		],
		"1_1CNWTRN6cn761Wyb4eauhUU8wiKgGSTMC7": [
			{
				"comment_id": 9,
				"body": "http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba Kaffiene search is good, just launched",
				"added": 1457006667
			}
		],
		"2_1GCsW9TFfjDsvcdmKPADq1n8Q3ha72UtDQ": [
			{
				"comment_id": 10,
				"body": "I don't really program, however I like Rust, Scala and Python.",
				"added": 1457011281
			}
		],
		"1_1A6hcWNpQ9SSLoTTpuT19VsVQ6WCVRkyen": [
			{
				"comment_id": 11,
				"body": "I sent you a message, do you see it? Send one back and make everything is working ok.",
				"added": 1457013865
			},
			{
				"comment_id": 12,
				"body": "No nothing from you. If you're new, try restarting zeronet and after that go to a bunch of sites to pull in plenty of data and see if your emails turn up then. When I created my blog the other day it took a while for new posts to get around, that's the downside to this sort of federation, but at some point your messages will come through. I am receiving my mail ok myself.",
				"added": 1457014747
			}
		],
		"1_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 13,
				"body": "You only store the data of sites you go on. From the home page of zeronet you can delete sites you no longer want on your computer.",
				"added": 1457015653
			},
			{
				"comment_id": 14,
				"body": "> [angristan](#comment_3_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7): Yes but if I go on dozens of sittes every day, or if a website uses a lot of data\n\nI have about 80 sites cached on my machine and it is taking up 600mb. So yes I see your problem, maybe the zeronet people should allow for a cap if one is not already in place, saying that I have 910gb of free space and it likely won't be used for much else so for me personally it is not an issue.",
				"added": 1457018200
			}
		],
		"2_1KJFB4SEHaHCY11HMKsMGyth1mXKb3R5oY": [
			{
				"comment_id": 15,
				"body": "Better one here http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba",
				"added": 1457034609
			},
			{
				"comment_id": 16,
				"body": "> [oxilic](#comment_37_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i): That's just a direct copy of zerosearch's source code with less links, and a bad way to add sites.  I can't see how that's better.\n\nIt has more links...",
				"added": 1457035509
			},
			{
				"comment_id": 17,
				"body": "> [effekt](#comment_16_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP): It has more links...\n\noh ok zerosearch has been updated",
				"added": 1457035539
			}
		],
		"3_1LPrQCYEyVA3Pz3gEVEf7Qc2z12QGNCSbd": [
			{
				"comment_id": 18,
				"body": "DON'T GO THERE.",
				"added": 1457059303
			},
			{
				"comment_id": 22,
				"body": "> [effekt](#comment_18_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP): DON'T GO THERE.\n\nDon't worry people, I panicked.",
				"added": 1457061048
			}
		],
		"9_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 19,
				"body": "> [daedalus](#comment_9_1LPrQCYEyVA3Pz3gEVEf7Qc2z12QGNCSbd): you cant, just move your site to a new address and sign it. be sure to secure your private key this time.\n\nI went to your site and used my private key to login not realising I was still on your domain. Do you have my private key on your machine now?",
				"added": 1457060150
			},
			{
				"comment_id": 20,
				"body": "> [daedalus](#comment_11_1LPrQCYEyVA3Pz3gEVEf7Qc2z12QGNCSbd): No, just inspect the source code if you like to and you'll be sure.\n\nNah I thought my details would get added to your users.json file or something but I just tried it on my machine and it hasn't. That's not to say my details haven't been cached anywhere though, further searching needed.",
				"added": 1457060656
			},
			{
				"comment_id": 21,
				"body": "OK everything is fine :)",
				"added": 1457061008
			}
		],
		"10_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 23,
				"body": "> [bowl](#comment_5_1PmQPsmpcuDvtjKQ6J9g2bH39w1TKAwGPr): then use a VPN and route all ZN traffic through it. That way its just some random user name and thats all they have.\n\nNo, you're wrong. When you post, you sign it with your ZeroNet ID, has nothing to do with using a VPN. I didn't say your IP is leaked, just you ZeroNet ID.",
				"added": 1457066957
			},
			{
				"comment_id": 24,
				"body": "wow fuck off @request",
				"added": 1457067351
			},
			{
				"comment_id": 25,
				"body": "> [bowl](#comment_9_1PmQPsmpcuDvtjKQ6J9g2bH39w1TKAwGPr): Yeah zeronet ID is just a randomly generated encrypted key pair. You can easily delete it and make another.\n\nYes sure, I'm just making sure people know that their IDs are visible to anyone who wants to know even when the site states they're anonymous, may lul people into a sense of a false security.",
				"added": 1457069189
			}
		],
		"1_16SHqxwSkfr3HFnhAq4AxsZ9TaoLzpPmGu": [
			{
				"comment_id": 26,
				"body": "My issue with anarchism is that it wants to jump straight to a stateless society. A state is a means of enforcing one class's will onto other classes. Anarchists aren't taking the state for the working class to enforce its will on the other classes, the working class's will to do away with class antagonisms. I essentially went from Anarchism to Communism in my thinking because it is just too easy for the capitalists to regroup and seize power again.",
				"added": 1457119528
			}
		],
		"1_1E1PGsCSCNzkP8xmx8awJ2hho3cPdsN4FF": [
			{
				"comment_id": 27,
				"body": "I will eventually blog is Esperanto here :P http://127.0.0.1:43110/16exauHuGYMYnZosskjcuLU5bnSuLZPDGR Saluton! Also if you like the communist posts I have keep an eye out for when I finished scanning this https://drive.google.com/file/d/0Bw2z721AQZI7b2JSV0RUYXFSYU0/view",
				"added": 1457142099
			},
			{
				"comment_id": 32,
				"body": "Here is the book I'm scanning (new page included that I didn't post to google drive)http://127.0.0.1:43110/16exauHuGYMYnZosskjcuLU5bnSuLZPDGR/?Post:9:Digitising+Germana+Demokratia+Respubliko+bildoj+kaj+faktoj+-+should+be+done+soon",
				"added": 1457195038
			}
		],
		"1_18gxSTCDsizAsHe6UjBP5VJu8AeokVhStc": [
			{
				"comment_id": 28,
				"body": "Yes the 300mb tv series that ettv uploads are an ideal size",
				"added": 1457177479
			}
		],
		"1_13qeq1z87R1kQWDZUQYm3y7tDCLimnhfvS": [
			{
				"comment_id": 29,
				"body": "The users: proxy@zeroid.bit and zeroupload@zeroid.bit are the ones who shared the files, try sending them some mail.",
				"added": 1457194413
			},
			{
				"comment_id": 30,
				"body": "> [effekt](#comment_29_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP): The users: proxy@zeroid.bit and zeroupload@zeroid.bit are the ones who shared the files, try sending them some mail.\n\nCan't find either of those usernames on ZeroMail, weird.",
				"added": 1457194587
			},
			{
				"comment_id": 31,
				"body": "The code is in your system if you've been on the site, look here: path/to/ZeroNet-master/data/1Q7dKG1kLuGfUwKdwbVfC7sKo7hEF5nbEr",
				"added": 1457194672
			}
		],
		"1_1BhtLu1iKdZ2HaBNUrDdmwqF11ZC4y3zL": [
			{
				"comment_id": 33,
				"body": "It says 1 file update failed for me, still works ok though.",
				"added": 1457195499
			}
		],
		"3_1P97itWECWCYp7D73wY4GaTKUyUo4A3Pcf": [
			{
				"comment_id": 34,
				"body": "Stop everything. Get the user.json with the identity you want from computer1. Delete the user.json on computer2. Paste user.json you got from C1 to C2. Start up ZeroBundle on C2. Did that work?",
				"added": 1457196343
			}
		],
		"1_1Kg7CXZM5h3wTPENsTDwWUmRBf9VhYy2cW": [
			{
				"comment_id": 35,
				"body": "A revolution of the proletarian variety?",
				"added": 1457204438
			}
		],
		"7_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 36,
				"body": "twit.tv's security now\nbad voltage\nthe expanse podcast\nUPDATE: AntennaPod just would not start, accidentally nuked my podcast list -.-\nI also listen to jupiter broadcasting's unfilter, LAS and CR\nhttp://www.newrustacean.com/",
				"added": 1457362040
			}
		],
		"1_1BQg5MQZ63aEQZMzLEXP6yY3hsgznKpaps": [
			{
				"comment_id": 37,
				"body": "mint",
				"added": 1457697094
			}
		],
		"12_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 38,
				"body": "I was wondering what people think about him and his politics.",
				"added": 1458064455
			},
			{
				"comment_id": 39,
				"body": "I was wondering what people think about him and his politics.",
				"added": 1458064625
			},
			{
				"comment_id": 40,
				"body": "Actually found more info here http://www.4pt.su/en",
				"added": 1458065012
			}
		],
		"11_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 41,
				"body": "> [antifa](#comment_30_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h): You mean it'll turn out badly if you colonize a place, map arbitrary borders through tribes, and support dictators for 100 years? And destabilizing the region with a decade of made-up wars? We need to do everything we can to support the PKK and the Syrian Kurds, bring peace and democracy to the region for once.\n\nOK you support the PKK and the Syrian Kurds... then what about the arab populations?\nWe should be supporting Assad until western puppets are defeated.\nThe trouble with the Kurds is that some of them want to balkanize the M.E. and that makes it easier for imperialism.",
				"added": 1458795816
			},
			{
				"comment_id": 42,
				"body": "> [antifa](#comment_40_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h): \"balkanization\" seems like a bad word, but in a region where different groups are split by arbitrary european borders, i could help.\n\nBalkanisation is the perfect word. The west want to break up Syria on ethnoreligious lines. https://www.youtube.com/watch?v=TnkaZFxO3zY",
				"added": 1459515441
			}
		]
	},
	"comment_vote": {
		"1_17z5FGPZEN2L6xMFDT5n4YTKvPivJfiuSG": 1,
		"1_135brhPGmL8zaPAJBFgR69pW7WWxWkNsQu": 1,
		"7_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"1_1JhBwd7aCUvR7So1XmeQiBKy9iPChgqUKn": 1,
		"64_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"1_15YUzYgogtiHYqXP5HXtdLS2dLZuxnvuRQ": 1,
		"2_1LVL5r7L5AwFk7waWmBwuVZ8Fcg9NDxakY": 1,
		"1_1JdybQdEoeQWopiKvksr743vnMXigW8dzT": 1
	}
}