{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_163rm8X1WReQzp1uAZjbrCHkF7En1VTXbU": 1,
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_163rm8X1WReQzp1uAZjbrCHkF7En1VTXbU": [
			{
				"comment_id": 1,
				"body": "Ja Leute, die Zeiten ändern sich. AfD ist die Partei der Stunde.\n\nDie Sozis und der ganze Merkel-Schund haben abgewirtschaftet, das weiß doch eh' jeder.\n\nJe eher man den Dreck los wird, umso besser.",
				"added": 1458587491
			},
			{
				"comment_id": 2,
				"body": "> [lukipuki](#comment_46_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8): nette idee, aber bitte übernimmt das jemand, der auch ab und zu mal spam/getrolle entfernt. Das ist hier im normalen Forum schon nervend. In einem deutschsprachigen Forum könnte das ja noch schwieriger werden... :)\n\nWürde sagen, auf Trolle wie lukiPuke können wir verzichten, oder?",
				"added": 1458587570
			},
			{
				"comment_id": 5,
				"body": "> [lukipuki](#comment_48_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8): so in etwa könnte das funktionieren.Allerdings wäre es bestimmt auch noch ganz interessant, falls in Zukunft die Möglichkeit besteht, bestimmte Beiträge nicht zu seeden. Ne Meinung kann jeder haben. Aber ein Diskussionsforum sollte zur - jo - Diskussion benutzt werden. Wenn leute nur rumtrollen und eine sachliche Diskussion behindern, dann will ich auch nicht mitmachen, diese Inhalte aktiv mitzuverbreiten. Eine Information über einen 'nicht einsehbaren' Inhalt sollte aber immer da sein. Irgendein Feld, wo man draufklicken kann um es sich dennoch anzusehen. Falls man sowas aktiviert hat, würde der Inhalt auch erst nach dem anklicken nachgeladen/geseeded werden.Das würde langfristig auch dazu führen, dass die Diskussionsteilnehmer ihre eigene Diskussionskultur aufpolieren, um im Gegenzug dafür Bandbreite zu bekommen. Wer dann immer nur undifferenzierten Quatsch posted wird dann langfristig weniger gelesen. Find ich ok. Sowas ähnliches wie ne Trolldrossel :) brauchen wir wahrscheinlich irgendwann.\n\n\nUnd zwar die Trolldrossel  konkret ausprogrammiert gegen den spammer lucky-puke. ich fang schon mal an...",
				"added": 1458588866
			},
			{
				"comment_id": 6,
				"body": "> [yeti](#comment_35_14tJBPnxcrF9kMK5v7DULWnaJx3JepirXb): Demokratie ist 'n harter Job und scheinbar profitieren ihre Gegner überproportional von ihr...\n\ndie Scheiße hier ist keine Demokratie, sowiel ist dir klar, oder?",
				"added": 1458588936
			},
			{
				"comment_id": 7,
				"body": "> [yeti](#comment_34_14tJBPnxcrF9kMK5v7DULWnaJx3JepirXb): Bevor man die AfD lobt, sollte man deren Programmentwurf gelesen haben.Die von der AfD Profitierenden sind definitiv nicht \"das Volk\"...\n\ndu klingst wie einer, der immer zum wahltag den schwachsinn der csu auswendig kennt.\n\njo mei gell",
				"added": 1458589010
			},
			{
				"comment_id": 8,
				"body": "> [lukipuki](#comment_49_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8): Hui wunderbar dein Spitznamen-Game ist aber allererste Sahne!\n> \n> lukiPuke\n> lucky-puke\n> \n> Ich bin gespannt welche Stilblüten meines Nicknames hier als nächstes erscheinen. Ich aktualisiere die Liste mal wenn da noch kreative Wortspielchen kommen. Freu mich drauf.\n\ndu, ich gönn's dir!  :-)",
				"added": 1458589109
			},
			{
				"comment_id": 9,
				"body": "Also ich faß' das mal kurz zusammen:\n\nMerkel + Sozis will in Deutschland keiner mehr.\n\nZeit, aktiv zu werden.",
				"added": 1458589516
			}
		],
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 3,
				"body": "Hey, I understand that the Donald Drumpf is not a pro-semitist, he kinda endorsed Dr. David Duke of KKK fame. So you want to kick out all Donald supporters?\n\nYou're biting off quite sth. to chew there, d00de!",
				"added": 1458587819
			}
		],
		"5_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 4,
				"body": "> [berliner](#comment_2_163rm8X1WReQzp1uAZjbrCHkF7En1VTXbU): Yes! It will be very hard to keep 0net \"in line\" with the liars from mainstream corporate media.\n> Finally the age of media freedom has dawned. Power to the people!\n\nOh yes!\nThose liars of wikipedia will now go down. Good riddance!\n\nThe era of THE PEOPLE's WIKI has finally come!",
				"added": 1458588370
			}
		]
	},
	"comment_vote": {
		"1_163rm8X1WReQzp1uAZjbrCHkF7En1VTXbU": 1,
		"21_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT": 1,
		"3_163rm8X1WReQzp1uAZjbrCHkF7En1VTXbU": 1,
		"4_16Vj2Cxw7UcghVxoRiiE4wJ7k7dtHM4SM6": 1,
		"2_163rm8X1WReQzp1uAZjbrCHkF7En1VTXbU": 1,
		"1_1DjezZz4h4amzFHeeq1cMJzWfNCnHcamby": 1,
		"35_14tJBPnxcrF9kMK5v7DULWnaJx3JepirXb": 1,
		"9_16Vj2Cxw7UcghVxoRiiE4wJ7k7dtHM4SM6": 1
	}
}